[
  {
    "number": 1,
    "Level": "大吉",
    "Content": "巍巍独步向云间，玉殿千官第一班，富贵荣华天付汝，福如东海寿如山。",
    "Detail1": "此签谋望事绪。无不遂意。但各有所主。官员占此。有超越之喜。士人有功名之庆。占前程者。福寿绵长。占事业者。根基稳固。若谋望求财。多主有名无实。为语多空虚也。",
    "Detail2": "犹如平步青云，一切皆可如愿实现，不论是福、禄、寿、喜，都能圆满，并且有超越的现象，可拔得头筹。自然而然地就能享有荣华富贵，这都是上天所给予的恩惠，所受的恩泽相当浩大，福气如海之无涯，寿如山之隽永，必须懂得珍惜。可说是得到了天时的配和，只要再加上地利及人和，则无往不利，是上上签。",
    "Story": "汉高祖入关",
    "Story_Brief": "汉高祖刘邦进入关中,与民约法三章,赢得民心,奠定帝业。",
    "Items": "事业:登榜首;求财:有名无实;婚姻:成",
    "Level_EN": "Divine Favor",
    "Content_EN": "Ascending alone toward the clouds, First among a thousand in the jade hall, Wealth and honor bestowed by heaven, Fortune as vast as the sea, life as enduring as mountains.",
    "Detail2_EN": "Like walking on clouds, all your wishes will come true. Whether it's fortune, status, longevity, or joy, everything will be fulfilled, and you may even surpass expectations, reaching the top. You will naturally enjoy wealth and honor—these are blessings from heaven, vast and profound. Your fortune is as boundless as the sea, your life as enduring as mountains. You must learn to cherish this. With the alignment of time, place, and people, you will be unstoppable. This is the supreme lot.",
    "Story_EN": "The Founder",
    "Story_Brief_EN": "The first emperor entered the pass, made three laws with the people, won their hearts, and established his empire.",
    "Items_EN": "Career: Top Achievement; Wealth: Appearance Only; Relationships: Favorable"
  },
  {
    "number": 2,
    "Level": "上吉",
    "Content": "盈虚消息总天时，自此君当百事宜，若问前程归缩地，须凭方寸好修为。",
    "Detail1": "此签前运不佳。前事蹭蹬。自此以后。渐见顺利。若问究竟归结。全在存心种德。方得成实。倘值境遇遂意。顿忘前因。暗损心术。必至有始无终。自贻后悔。勉之慎之。",
    "Detail2": "曾经遇到不顺遂的过去，到现在也该是转运的时候了，之后会渐入佳境，但不可因此而骄纵。如能从心做起，随时随地都能发出善的念头，积累福荫，必会有美好的未来。此签的重点在于心里的想法，如能以善念出发，必能排除万难达成目标，但如有偏斜的歹念，则会为自己招来厄运，不可不慎。",
    "Story": "张子房惜体",
    "Story_Brief": "张良在下邳圯桥为黄石公拾鞋,通过考验获得太公兵法。",
    "Items": "功名:渐进;婚姻:成;疾病:慎防暗损",
    "Level_EN": "High Resonance",
    "Content_EN": "The ebb and flow follow heaven's timing, From now on, all things will align, If you ask about your future path, Rely on the goodness within your heart.",
    "Detail2_EN": "You've had difficult times in the past, but now it's time for a change. Things will gradually improve, but don't let this make you arrogant. If you can start from the heart, generating kind thoughts at all times and accumulating blessings, you will have a beautiful future. The key to this lot lies in your inner thoughts. If you act from good intentions, you can overcome all obstacles and achieve your goals. But if you harbor malicious thoughts, you will bring misfortune upon yourself. Be careful.",
    "Story_EN": "The Student",
    "Story_Brief_EN": "A young scholar picked up shoes for an old master at a bridge, passed the test, and received the ancient art of strategy.",
    "Items_EN": "Achievement: Gradual Progress; Relationships: Favorable; Health: Beware Hidden Issues"
  },
  {
    "number": 3,
    "Level": "中吉",
    "Content": "衣食自然生处有，劝君不用苦劳心，但能孝悌存忠信，福禄来成祸不侵。",
    "Detail1": "此签只宜守旧。不可贪求。但存中直。却得两平。须以孝悌忠信为本。自有福禄来成之应。若思强取强求。反招意外之祸。占者循理守分则吉。",
    "Detail2": "人生自然该有的衣食住行，在冥冥中自有定数，该吃多少、该用多少，都有一定的份量，不可太过强求，如果一餐吃一碗饭就饱了，一时贪心吃了两碗，也只有苦了自己的肚子了。如果能从人伦的孝悌做起，对上尽忠，为人诚信，相信福禄自会天成，祸患与你无缘。此签重在自我的修养，谨记孝悌忠信，则必能去灾解厄，吉运自现。",
    "Story": "贾谊遇汉文帝",
    "Story_Brief": "贾谊虽有才华但早年坎坷,后被汉文帝召见,受到重用。",
    "Items": "功名:晚成;求财:平平;婚姻:待时",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Food and clothing come naturally, No need to toil and worry, With filial piety, loyalty, and trust, Fortune arrives, misfortune stays away.",
    "Detail2_EN": "The basic necessities of life—food, clothing, shelter—are predetermined. You can't force more than what's meant for you. If you're meant to eat one bowl of rice, eating two will only make you uncomfortable. If you can practice filial piety and brotherly love, show loyalty to superiors, and be trustworthy, fortune will naturally come to you, and misfortune will stay away. This lot emphasizes self-cultivation. Remember filial piety, brotherly love, loyalty, and trust, and you will overcome disasters and find good fortune.",
    "Story_EN": "The Scholar",
    "Story_Brief_EN": "A talented scholar faced early hardships, but was later summoned by the emperor and given great responsibility.",
    "Items_EN": "Achievement: Late Success; Wealth: Moderate; Relationships: Await Timing"
  },
  {
    "number": 4,
    "Level": "下下",
    "Content": "去年百事可相宜，若较今年时运衰，好把瓣香告神佛，莫教福谢悔无追。",
    "Detail1": "此签吉事已去。凶祸将来。官事临身。是非自至。凡事谋望不成。求财交易不就。所为皆不利。急宜祈祷神明。积德回天。庶不致贻后悔耳。",
    "Detail2": "去年的运势相当顺遂，几乎想做的事都可以成功，相较于今年，则出现了明显的衰运，这就是人生，可见的厄运是无法避免了，该如何将伤害减至最低呢？不如诚心的祷告神明，以诚挚的心焚香膜拜，如能得到神佛的帮助，则能转危为安、转祸为福，若无真心祈求，祸患无法避免，将后悔莫及，还是尽早修为吧！",
    "Story": "小秦王三跳涧",
    "Story_Brief": "李世民被敌军追赶,陷入困境,诚心祈祷后神驹跳涧脱险。",
    "Items": "诉讼:凶;求财:无;婚姻:不就",
    "Level_EN": "Challenging Phase",
    "Content_EN": "Last year all things went well, This year fortune seems to decline, Light incense and pray to the gods, Don't let blessings fade, or regret will follow.",
    "Detail2_EN": "Last year's fortune was quite smooth—almost everything you wanted succeeded. Compared to this year, there's a clear decline. This is life; visible misfortune cannot be avoided. How to minimize the damage? Sincerely pray to the gods, burn incense with a sincere heart. If you can get help from the divine, you can turn danger into safety, misfortune into fortune. Without sincere prayer, misfortune cannot be avoided, and you will regret it. It's best to cultivate yourself early.",
    "Story_EN": "The Warrior",
    "Story_Brief_EN": "A prince was pursued by enemies, fell into danger, and after sincere prayer, his divine steed leaped across a ravine to escape.",
    "Items_EN": "Legal: Challenging; Wealth: Limited; Relationships: Unfavorable"
  },
  {
    "number": 5,
    "Level": "中平",
    "Content": "子有三般不自由，门庭萧索冷如秋，若逢牛鼠交承日，万事回春不用忧。",
    "Detail1": "此签先忧后喜。见在主意不定。进退无据。景况甚为冷落。等子丑交承之际。远应年分。近应月日。自有更新气象。如春来万物发生。此前大不相同。凡事待时。终有成就。",
    "Detail2": "此时的你是万事都无法随心所欲，就算是连最简单的沟通，都是词不达意，连朋友都忘了有你这个人的存在，可说是冷到了极点。厄运总是会结束的，只要过了子丑的交接转换，就会有美好的未来，会犹如春天的来到，将不必忧愁，此时只是日出前的黑暗。子丑交换最久可能是鼠牛年的交换，也可能是鼠牛月或鼠牛日的交换，不论还要多久必须忍耐，迎接美好的未来。",
    "Story": "吕蒙正守困",
    "Story_Brief": "吕蒙正早年家贫守困,在破窑中读书,后官至宰相。",
    "Items": "现状:冷落;功名:待时;万事:回春",
    "Level_EN": "Neutral Path",
    "Content_EN": "Three constraints bind you now, Your home is cold as autumn, When the ox and rat exchange, All things will bloom again, no need to worry.",
    "Detail2_EN": "Right now, nothing goes as you wish. Even the simplest communication fails, and friends seem to have forgotten you. It's as cold as it can get. But misfortune always ends. Once the transition between the ox and rat passes, there will be a beautiful future, like spring arriving. You won't need to worry—this is just the darkness before dawn. The ox-rat transition could be the year, month, or day. No matter how long you must wait, be patient and welcome the beautiful future.",
    "Story_EN": "The Endurer",
    "Story_Brief_EN": "A poor scholar endured hardship, studied in a dilapidated kiln, and later became prime minister.",
    "Items_EN": "Current Situation: Neglected; Achievement: Await Timing; All Matters: Revival"
  },
  {
    "number": 6,
    "Level": "下下",
    "Content": "何劳鼓瑟更吹笙，寸步如登万里程，彼此怀疑不相信，休将私意忆浓情。",
    "Detail1": "此签谓之阳为君子。阴为小人。须防有面是背非之人。从此簸弄。彼此怀疑不信。前此浓情。今已中变。何用私意系恋。自取烦恼。凡事拨开迷妄则吉。",
    "Detail2": "虽然你以很热忱的心与人交往，但对方却是个里外不一的人，看起来和你是那么近的距离，但却永远也无法知道对方在想什么，显得相当陌生。如果你还陷在过去的浓情蜜意之中，将自己沉浸在过去，将万劫不复，因为彼此已经产生了怀疑，倒不如就此放下，不必再为此事或此人努力，或许伤害就到此为止，及早清醒才是。",
    "Story": "管鲍分金",
    "Story_Brief": "管仲与鲍叔牙为友,管仲贫困时鲍叔牙慷慨相助,后管仲成为齐国名相。",
    "Items": "婚姻:疑;求财:无;人际:防小人",
    "Level_EN": "Challenging Phase",
    "Content_EN": "Why play music when trust is gone, Each step feels like a thousand miles, Doubt and suspicion between us, Let go of past affections, move on.",
    "Detail2_EN": "You've been warm and sincere in your relationships, but the other person is two-faced. They seem close, but you can never know what they're really thinking. If you keep dwelling on past sweet memories, you'll only hurt yourself more. Since trust has been broken, it's better to let go and move forward. Stop trying to fix what's broken—the damage ends here. Wake up and move on.",
    "Story_EN": "The Loyal Friend",
    "Story_Brief_EN": "Two friends shared everything. When one was poor, the other helped generously. Later, the poor friend became a great minister.",
    "Items_EN": "Relationships: Uncertain; Wealth: Limited; Social: Beware Deceit"
  },
  {
    "number": 7,
    "Level": "大吉",
    "Content": "仙风道骨本天生，又遇仙宗为主盟，指日丹成谢岩谷，一朝引领向天行。",
    "Detail1": "此签贵人占之。有荐拔之喜。仕人占之。有飞腾之兆。庶人占之。有百倍之利。方外占之。有仙升之期。病患占之。有医药之缘。亦恐有正应反应不同。占者审之。",
    "Detail2": "比别人幸运的是天生就有道缘，而且又遇到高人的指点，可以很顺利的寻得求道之路，而且可以一路顺遂，得到不错的成就。此签又可解为求医者可求得良药，但又有仙升，即作古升天之意，故求签者要小心处置。此签虽是大吉，但除了以上所提之事，对其余事情几乎都无任何影响，所以不可全部判断为大吉签。",
    "Story": "张良遇黄石公",
    "Story_Brief": "张良得遇黄石公传授太公兵法,后辅佐刘邦建立汉朝。",
    "Items": "功名:大吉;疾病:有医缘;事业:飞腾",
    "Level_EN": "Divine Favor",
    "Content_EN": "Divine nature is inborn, Meeting a master to guide the way, The elixir will be complete soon, One day ascending to the heavens.",
    "Detail2_EN": "You're blessed with natural talent and have met a great teacher. Your path forward is clear, and you'll achieve remarkable success. For those seeking healing, you may find the right medicine. However, be cautious—this sign also suggests a transformation, like ascending to another realm. While this is a very favorable sign, its influence is specific to certain areas of life.",
    "Story_EN": "The Apprentice",
    "Story_Brief_EN": "A young man met an immortal master who taught him the ancient art of strategy. He later helped establish a great dynasty.",
    "Items_EN": "Achievement: Very Favorable; Health: Medical Help Available; Career: Rapid Rise"
  },
  {
    "number": 8,
    "Level": "上上",
    "Content": "年来耕稼苦无收，今岁田畴定有秋，况遇太平无事日，士农工贾百无忧。",
    "Detail1": "此签宜安常守分。前虽困顿。今渐有成。譬如田畴。既有荒歉。亦有丰收。幸处光天化日之下。农工商贾。共享升平。何忧之有。凡事安享自然。时日以秋季为断。",
    "Detail2": "过去的努力似乎都没有收获，只要再持续下去，今年必定会有结果，而且是不错的回收。田里的收成，完全要靠老天爷的帮忙，适逢风调雨顺，得以丰收，各行各业也因此而有所斩获。此签表示即将有所收获，不管之前有多么不顺遂，到此又是另一番景象，要好好把握，也表示以前的努力，现在才开始要回收，将会有美好的未来。",
    "Story": "大舜耕田",
    "Story_Brief": "大舜在历山耕田,以孝行感动天地,后被尧帝禅让为帝。",
    "Items": "事业:丰收;求财:有;婚姻:成",
    "Level_EN": "Supreme Harmony",
    "Content_EN": "Years of toil with no harvest, This year the fields will bear fruit, In peaceful times we live, All people prosper without worry.",
    "Detail2_EN": "Your past efforts seemed fruitless, but if you persist, this year will bring results—good results. Like crops that depend on favorable weather, you'll finally see a bountiful harvest. All industries will benefit. This sign indicates that rewards are coming. No matter how difficult things were before, a new chapter begins now. The efforts you've made are finally paying off, and a bright future awaits.",
    "Story_EN": "The Filial Son",
    "Story_Brief_EN": "A filial son farmed the land, moved heaven and earth with his virtue, and was later chosen to become emperor.",
    "Items_EN": "Career: Bountiful Harvest; Wealth: Promising; Relationships: Favorable"
  },
  {
    "number": 9,
    "Level": "大吉",
    "Content": "望渠消息向长安，常把菱花仔细看，见说文书将入境，今朝喜色上眉端。",
    "Detail1": "此签谋为之事。旦夕喜信。若问行人。旦夕即至。婚姻和合。疾病回头。士子科名捷报。仕宦得位超迁。叩问运程。即见好消息也。",
    "Detail2": "对于期待已久的消息，已经等得快要不耐烦了，然而在突然间却得到好消息的传来，令人喜出望外，不禁喜上眉稍，一切的辛劳都有了回应。表示经过了长时间的等待，终于有了好回报。此签表示要发挥极大的耐心，不可因暂无消息而放弃，只要能持续以待，必得好的佳音。",
    "Story": "宋太祖登基",
    "Story_Brief": "赵匡胤陈桥兵变,黄袍加身,建立宋朝,消息传来众人欢喜。",
    "Items": "功名:捷报;婚姻:和合;疾病:回头",
    "Level_EN": "Divine Favor",
    "Content_EN": "Waiting for news from afar, Gazing into the mirror often, Word arrives that documents are coming, Today joy appears on your face.",
    "Detail2_EN": "You've been waiting anxiously for long-awaited news, and suddenly good news arrives, bringing unexpected joy. All your patience and waiting have paid off. This sign reminds you to be patient—don't give up just because there's no immediate response. If you persist in waiting, good news will surely come.",
    "Story_EN": "The Ruler",
    "Story_Brief_EN": "A general rose to power through a military coup, established a new dynasty, and the news brought joy to all.",
    "Items_EN": "Achievement: Good News; Relationships: Harmonious; Health: Recovery"
  },
  {
    "number": 10,
    "Level": "下下",
    "Content": "病患时时命蹇衰，何须打瓦共钻龟，直教重见一阳后，始可求神仗佛持。",
    "Detail1": "此签大意晓然。凡有前恶。须宜求神忏悔。若问病讼。冬至后方可。不然莫解。若作非为。祸患立至。占者守分修省可保。",
    "Detail2": "目前的运势相当不好，如是问病，必是久病不愈，短时间内不会好转。就算是求神问卜，也是无济于事，不如相信上天的安排，冥冥中自会有所变化。运势必须到冬至时才会好转，而且会有很大的变化，此时宜平心静气地等待好运的到来，若不相信天理的安排，一意孤行，则必会招来厄运，谨慎而行。",
    "Story": "严子陵钓鱼",
    "Story_Brief": "严子陵隐居富春江,垂钓为乐,拒绝出仕,保持高洁品格。",
    "Items": "疾病:冬至后好;诉讼:凶;求财:无",
    "Level_EN": "Challenging Phase",
    "Content_EN": "Illness persists, fortune declines, No need for divination now, Wait until the winter solstice, Then seek divine help and guidance.",
    "Detail2_EN": "Your current fortune is quite poor. If asking about illness, it's a chronic condition that won't improve quickly. Even prayers and divination won't help right now. Trust in heaven's timing—change will come naturally. Your fortune will improve significantly after the winter solstice. Be patient and wait calmly for better times. If you don't trust fate and act recklessly, you'll only invite more misfortune. Proceed with caution.",
    "Story_EN": "The Hermit",
    "Story_Brief_EN": "A hermit lived by the river, fishing for pleasure, refusing official positions, maintaining his noble character.",
    "Items_EN": "Health: Better After Winter Solstice; Legal: Challenging; Wealth: Limited"
  },
  {
    "number": 11,
    "Level": "下下",
    "Content": "今年好事一番新，富贵荣华萃汝身，谁识机关难料处，到头独立转伤神。",
    "Detail1": "此签先吉后凶。先实后虚。先热闹后落陷。先稠密。后妒害。识透机关。须是平气忍受。善自解脱。不可急躁生事。更加缠缚。独立伤神。明是小人结党。君子守正。孤立无与。静以需之。困可亨。否可泰也。反此则凶。",
    "Detail2": "今年开始就好事不断，甚为顺遂，而且显得光鲜亮丽，但是人生事事难预料，世事变化无常，受到小人的设计及陷害，让人暗自神伤，但这是考验君子的时候，如果你也和对方一样耍诈，那你和对方又有什么不一样呢？此时应该静下心来，不好的运势，如何抵抗还是不好，倒不如等待好运势的到来，终有否极泰来的时候。",
    "Story": "韩信受胯下之辱",
    "Story_Brief": "韩信早年受辱,后投靠刘邦,成为大将军,但最终因功高震主而被害。",
    "Items": "事业:先吉后凶;求财:有名无实;婚姻:防变",
    "Level_EN": "Challenging Phase",
    "Content_EN": "This year begins with new fortune, Wealth and honor gather around you, But hidden dangers lie ahead, In the end, you stand alone, wounded.",
    "Detail2_EN": "This year started with continuous good fortune, everything seemed smooth and bright. But life is unpredictable, and you've been betrayed and harmed by scheming people. This is a test of character. If you respond with the same deceit, how are you different from them? Stay calm—you can't fight bad fortune by resisting it. Instead, wait patiently for better times. Eventually, fortune will turn in your favor.",
    "Story_EN": "The Resilient Warrior",
    "Story_Brief_EN": "A warrior endured early humiliation, later became a great general, but ultimately fell victim to his own success.",
    "Items_EN": "Career: Good Then Challenging; Wealth: Appearance Only; Relationships: Beware Changes"
  },
  {
    "number": 12,
    "Level": "中平",
    "Content": "营为期望在春前，谁料秋来又不然，直遇清江贵公子，一生活计始安全。",
    "Detail1": "此签几番谋望。事与愿违。屡次相左。然遇合有定。须在近江之地。或水旁姓名之人。必有格外投契。一味靠着此人。可保生计安全。此当关系夙缘。不可以有意求。只可以无意遇。莫之为而为。莫之致而致。静。以俟之可耳。",
    "Detail2": "看似美好的计划，但总是无法成局，在反反复覆之中，总无定见，这表示时机未到，就算勉强行之，也只能以失败收场。会有一个机缘来改变这一切的衰运，如能遇见住在水边的人或是姓名有水部的人．才得以改运，必须是在无意间遇到的人，刻意认识是没用的，此人将对你的下半生起了极大的变化，几乎会以对方为主导了，从此没有生计上的疑虑。时机到了此人必会出现，不可强求。",
    "Story": "苏秦不第",
    "Story_Brief": "苏秦游说失败,回家受冷遇,后发奋读书,终成六国宰相。",
    "Items": "功名:待时;求财:遇贵人;婚姻:待缘",
    "Level_EN": "Neutral Path",
    "Content_EN": "Plans made before spring, But autumn brings different results, Meeting a noble by the river, Your life's path becomes secure.",
    "Detail2_EN": "Your well-laid plans keep falling through, nothing seems to work out. This means the timing isn't right—forcing things will only lead to failure. A chance encounter will change your fortune. If you meet someone who lives by water or has water in their name, your luck will turn. This must be an accidental meeting, not a deliberate one. This person will transform your life, taking the lead in your affairs. When the time comes, this person will appear—don't force it.",
    "Story_EN": "The Determined Scholar",
    "Story_Brief_EN": "A scholar failed in his diplomatic mission, returned home to cold treatment, studied hard, and eventually became prime minister of six states.",
    "Items_EN": "Achievement: Await Timing; Wealth: Meet Benefactor; Relationships: Await Opportunity"
  },
  {
    "number": 13,
    "Level": "上吉",
    "Content": "君今庚甲未亨通，且向江头作钓翁，玉兔重生应发迹，万人头上逞英雄。",
    "Detail1": "此签现在时运未济。且须安静耐守。如彼江头钓翁。何等闲散。宜待卯年月日。大有发迹。士子是时科第。仕宦是时升擢。商贾是时财利。定有高压万人之势。未可以泛常论也。",
    "Detail2": "目前的时运不佳，适合安身乐命，倒不如学习钓鱼的人，只要一份安闲，不须呼朋引伴，自在地享受那一份安静。快则卯月日，慢则卯年，会有大发之迹，必会成为各行各业的龙头，仕人升官、农人丰收、商人大利，而且会有万人之上的名声，而非一般的泛泛之辈，要好好把握，目前的等待是为了明日的成就。",
    "Story": "姜太公钓鱼",
    "Story_Brief": "姜太公在渭水垂钓,愿者上钩,后遇周文王,辅佐建立周朝。",
    "Items": "功名:卯年发迹;求财:大利;事业:万人之上",
    "Level_EN": "High Resonance",
    "Content_EN": "Your fortune hasn't arrived yet, Be like a fisherman by the river, When the jade rabbit returns, You'll rise above all others.",
    "Detail2_EN": "Your current fortune is poor, so it's best to live simply and peacefully, like a fisherman enjoying quiet solitude. Soon—perhaps in the month or year of the rabbit—you'll have a great breakthrough. You'll become a leader in your field, whether in government, farming, or business. You'll gain fame above all others. This waiting period is preparation for tomorrow's success.",
    "Story_EN": "The Wise Fisherman",
    "Story_Brief_EN": "An old fisherman waited by the river, fishing for those willing to be caught. He met a wise king and helped establish a great dynasty.",
    "Items_EN": "Achievement: Success in Rabbit Year; Wealth: Great Profit; Career: Above All Others"
  },
  {
    "number": 14,
    "Level": "下下",
    "Content": "一见佳人便喜欢，谁知去后有多般，人情冷暖君休讶，历涉应知行路难。",
    "Detail1": "此签先喜后忧。不宜放肆。大概亲而又疏。合而复离。历涉险阻。竟无成就。兢兢业业。庶免后悔。",
    "Detail2": "见到面貌姣好的女子，对其有好感，但经认识之后，却受到对方的百般刁难，大都是因为对方嫌弃你的条件，当然也包括了财力的不足，这种世间冷暖你会觉得讶异，其实只要是经历过重重险阻的人，才会真的相信并非所有的路都是那么好走的，如遇到险恶的路程也是正常的，不如先自我评估过后，再决定要如何做，只要小心行事，必能减少伤害。",
    "Story": "王昭君出塞",
    "Story_Brief": "王昭君远嫁匈奴,初时风光,后因政治变化而命运多舛。",
    "Items": "婚姻:先喜后忧;求财:无;人际:行路难",
    "Level_EN": "Challenging Phase",
    "Content_EN": "Love at first sight, But after parting, troubles arise, Don't be surprised by human nature, Experience teaches that the path is hard.",
    "Detail2_EN": "You're attracted to a beautiful person, but after getting to know them, you face constant difficulties. They likely look down on your circumstances, including your financial situation. This coldness from the world may surprise you, but those who've faced many obstacles know that not all paths are smooth. Some journeys are naturally difficult. Assess yourself honestly before deciding how to proceed. Proceed with caution to minimize harm.",
    "Story_EN": "The Peacemaker",
    "Story_Brief_EN": "A beautiful woman was sent far away in marriage, initially honored, but later suffered due to political changes.",
    "Items_EN": "Relationships: Joy Then Sorrow; Wealth: Limited; Social: Difficult Path"
  },
  {
    "number": 15,
    "Level": "中平",
    "Content": "两家门户各相当，不是姻缘莫较量，直待春风好消息，郄调琴瑟向兰房。",
    "Detail1": "此签现在谋事。甚不相宜。看似机缘。终竟反复。即宜舍此另图。自有好处。春间定得信息。如婚姻前定。自然和合。只可待时。不可妄为。时至自得成就耳。",
    "Detail2": "看似门当户对的两人，却不是谈姻缘的好对象，就算是强求也不会有结果，可能还会有反效果，倒不如先放下求亲的念头。当春天来临时，会另有好消息，而且是门好姻缘，这是桩好婚事，而且是天注定的，只要慎重行事，等待时机的来临，佳偶自会出现。",
    "Story": "张君瑞求凰",
    "Story_Brief": "张生与崔莺莺相爱,经历波折,终成眷属。",
    "Items": "婚姻:成;求财:有;事业:顺利",
    "Level_EN": "Neutral Path",
    "Content_EN": "Two families match in status, But this is not the right match, Wait for spring's good news, Then harmony will come to your home.",
    "Detail2_EN": "Two people seem well-matched, but they're not meant for each other. Forcing a relationship won't work and may backfire. It's better to let go of this pursuit. When spring comes, there will be better news—a true match, a good marriage that's meant to be. Be patient and wait for the right time. The right partner will appear naturally.",
    "Story_EN": "The Lover",
    "Story_Brief_EN": "A young scholar and a maiden fell in love, overcame obstacles, and eventually married.",
    "Items_EN": "Relationships: Favorable; Wealth: Promising; Career: Smooth"
  },
  {
    "number": 16,
    "Level": "下下",
    "Content": "官事悠悠难辨明，不如息了且归耕，旁人煽惑君休信，此事当谋亲弟兄。",
    "Detail1": "此签不利讼事。以和为贵。凡事虚悬无着也。犹疑不定。皆宜停止。恐有傍人怂恿。不可听信。唯有商谋亲密之人。骨肉之际。庶可免忧患耳。门内参商者宜戒之。",
    "Detail2": "此时如遇诉讼之事，将无法得到有利的结果，若能求和，甚至退隐山林，必能将伤害减至最低，当然你的心中会有忧虑和怀疑，不如在此都放下，才是最好的决定。会有身旁的人加以怂勇，千万不可相信，此时只能找自己的亲兄弟或亲信之人商议，而且不可走漏消息，应想办法让自己全身而退，不可再留恋了。",
    "Story": "王阳明格竹",
    "Story_Brief": "王阳明格物致知,悟出心学,成为一代大儒。",
    "Items": "功名:成;求财:有;疾病:愈",
    "Level_EN": "Challenging Phase",
    "Content_EN": "Legal matters are hard to resolve, Better to settle and return to farming, Don't trust others' persuasion, Consult only your closest kin.",
    "Detail2_EN": "If you're involved in legal disputes, you won't get a favorable outcome. It's best to settle, even retreat to a quiet life, to minimize damage. You may feel worried and uncertain, but it's better to let go. Others may try to persuade you, but don't trust them. Only consult your own brothers or most trusted people, and keep it secret. Find a way to withdraw completely—don't linger.",
    "Story_EN": "The Philosopher",
    "Story_Brief_EN": "A philosopher studied nature to understand truth, developed a new school of thought, and became a great master.",
    "Items_EN": "Achievement: Favorable; Wealth: Promising; Health: Recovery"
  },
  {
    "number": 17,
    "Level": "下下",
    "Content": "田园价贯好商量，事到公庭彼此伤，纵使机关图得胜，定为后世子孙殃。",
    "Detail1": "此签示人当依本分平等。凡事再三筹议。不可涉讼。讼则终凶。若恃财势贿嘱。或情面请托。虽侥幸一时之胜。终必欺心害理。不免子孙之受报耳。占者戒之。",
    "Detail2": "凡事在商场上，必须凭着公平及真心，不可仗势欺人，刻意剥削他人，如将事情闹上公堂，将对自己不利，甚至两败俱伤。纵使利用手段而获胜，也不是真正的胜利，公理自在人心，天地神明都看到了，其祸害将殃及子孙，所谓“不是不报，只是时候未到”，要深思。此签表示你经常违背常理行事，对私德有所损伤，怕会伤到后代，要小心谨慎。",
    "Story": "孟尝君养士",
    "Story_Brief": "孟尝君广纳门客,鸡鸣狗盗之徒也受重用,后靠门客脱险。",
    "Items": "事业:得助;求财:有;人际:贵人相助",
    "Level_EN": "Challenging Phase",
    "Content_EN": "Land prices can be negotiated, But court battles hurt both sides, Even if you win by trickery, Your descendants will pay the price.",
    "Detail2_EN": "In business, you must be fair and honest. Don't bully others or exploit them. Taking matters to court will harm both sides. Even if you win through manipulation, it's not a true victory. Justice is in people's hearts, and heaven sees all. The harm will affect your descendants. What goes around comes around. This sign warns that you often act against reason, damaging your virtue, which may harm future generations. Be careful.",
    "Story_EN": "The Patron",
    "Story_Brief_EN": "A nobleman welcomed all talents, even those with unusual skills. Later, these talents helped him escape danger.",
    "Items_EN": "Career: Get Help; Wealth: Promising; Social: Benefactor Helps"
  },
  {
    "number": 18,
    "Level": "中平",
    "Content": "知君指拟是空华，底事茫茫未有涯，牢把脚根踏实地，善为善应永无差。",
    "Detail1": "此签不宜妄意求谋。有名无实。只是空华。何用贪痴不已。不如按部就班。脚踏实地行去。内存善心。外行善事。将来自有善报。较之无益之求不已远乎。",
    "Detail2": "现在所想的美好景象，都是虚空的，而且是不切实际的，如果再一味地空想，将使自己陷入无底的深渊，倒不如脚踏实地，一步一步地踩稳，忘却过去的空想，多做善事，自然会有好的回报。此签表示目前还是耕耘的阶段，或许会很辛苦，但累积汗水，自会收获甜美的果实，只要一心向善，方向就不会错。",
    "Story": "狄仁杰断案",
    "Story_Brief": "狄仁杰明察秋毫,断案如神,成为一代名相。",
    "Items": "诉讼:胜;求财:有;事业:升迁",
    "Level_EN": "Neutral Path",
    "Content_EN": "Your plans are like empty flowers, Endless and without direction, Plant your feet firmly on the ground, Good deeds bring good rewards, always.",
    "Detail2_EN": "The beautiful visions you imagine are all empty and unrealistic. If you keep daydreaming, you'll fall into an endless abyss. Instead, be practical, step by step, forget past fantasies, and do good deeds. Good will naturally return to you. This sign means you're still in the cultivation phase. It may be hard, but your efforts will bear sweet fruit. As long as you follow the path of goodness, your direction is right.",
    "Story_EN": "The Judge",
    "Story_Brief_EN": "A judge saw through all deceptions, solved cases with divine insight, and became a great prime minister.",
    "Items_EN": "Legal: Victory; Wealth: Promising; Career: Promotion"
  },
  {
    "number": 19,
    "Level": "上吉",
    "Content": "嗟子从来未得时，今年星运颇相宜，营求动作都如意，和合婚姻诞贵儿。",
    "Detail1": "此签不问贵贱。皆主谋为和合。年运亨通。从前阻滞。一旦称心。凡动皆主有成。不须疑虑。",
    "Detail2": "在求得此签之前凡事皆不顺遂，然而从现在开始，运势好转，不论是求什么，几乎都可达成，尤其是求姻缘及子嗣方面，更是会有好结果。过去的不如意，都可以抛到脑后。对于顺利者，或许没有太大的感受，但对于原本失意的人，此签更是灵验，要好好把握良机，不可错过。",
    "Story": "刘玄德三顾茅庐",
    "Story_Brief": "刘备三顾茅庐请诸葛亮出山,终得贤相,建立蜀汉。",
    "Items": "事业:得贤;求财:有;婚姻:成",
    "Level_EN": "High Resonance",
    "Content_EN": "Never had good fortune before, This year the stars align, All your actions will succeed, Marriage blessed, noble child born.",
    "Detail2_EN": "Before drawing this lot, nothing went well. But now your fortune has turned. Whatever you seek will be achieved, especially in marriage and children. You can leave past disappointments behind. For those already doing well, this may not feel dramatic, but for those who've been struggling, this sign is especially powerful. Seize this opportunity—don't miss it.",
    "Story_EN": "The Seeker",
    "Story_Brief_EN": "A ruler visited a sage three times, seeking his help. Finally, the sage agreed and helped establish a great kingdom.",
    "Items_EN": "Career: Get Talent; Wealth: Promising; Relationships: Favorable"
  },
  {
    "number": 20,
    "Level": "下下",
    "Content": "一生心事向谁论，十八滩头说与君，世事尽从流水去，功名富贵等浮云。",
    "Detail1": "此签主同心无人。孤立少助。险难在前之象。既经指示。宜早提防。然大势已去。难可挽回。不啻流水浮云之变灭。唯有达观排遣。斩断利锁名缰。毋复系恋。更生事故。占者悟此。则知患难中玉成不少。或又有困而得亨之日乎。",
    "Detail2": "虽有满腹的心事，但总是没有一个可以倾诉的对象，一直以来都是挫折重重，未来所要面对的路途，也是惊险万分，这一切只能往自己肚里吞。人生世事难预料，对于遇到的不幸，只能让一切付诸流水，不要有太多的计较或留恋，想要等待富贵功名，似乎期待只能落空。此签虽然表示不好，但若能因事先知道而加以预防，或以平常心看待，则会较能释怀。",
    "Story": "严光垂钓",
    "Story_Brief": "严光拒绝光武帝征召,隐居富春江,保持高洁。",
    "Items": "功名:不仕;求财:淡泊;婚姻:不成",
    "Level_EN": "Challenging Phase",
    "Content_EN": "Who can I tell my heart's troubles, At eighteen rapids I speak to you, All worldly things flow away like water, Fame and fortune are but floating clouds.",
    "Detail2_EN": "You have so much on your mind, but no one to confide in. You've faced constant setbacks, and the road ahead looks dangerous. You can only swallow your troubles. Life is unpredictable, and misfortune must be let go like flowing water. Don't dwell on it or cling to it. Waiting for fame and fortune will only lead to disappointment. Though this sign seems negative, if you prepare in advance or accept it with equanimity, you'll find peace.",
    "Story_EN": "The Recluse",
    "Story_Brief_EN": "A hermit refused the emperor's call to serve, choosing instead to live by the river, maintaining his noble character.",
    "Items_EN": "Achievement: Not Seeking Position; Wealth: Contentment; Relationships: Unfavorable"
  },
  {
    "number": 21,
    "Level": "下下",
    "Content": "与君夙昔结成冤，今日相逢显恶缘，把好经文多讽诵，祈求户内保婵娟。",
    "Detail1": "此签系冤仇缠结。讼事最凶。急自耗财。和解为妙。贵人占之。谨和处世。多行善事。免遭凶祸。平人占之。求神忏礼。迁善改过。可得人口平安。一切谋为。均宜回心向善。乃可逢凶化吉。冤家宜解不宜结。明者悟之。",
    "Detail2": "或许过去因故与人结怨，而这些过节会因现在的相遇而发生冲突，对方也许会因此而有报复的行为发生，此时必须多诵念经文，将这些福报回向给家人，尤其是家中的女眷，对方会针对家中的女性加以报复，只要一心向善，不可恶言相向，则可逢凶化吉，事发时机可能会是月圆之日，要多加小心注意。",
    "Story": "孙膑下山",
    "Story_Brief": "孙膑学成下山,辅佐齐国,大败魏军,名扬天下。",
    "Items": "事业:大吉;求财:大利;功名:显",
    "Level_EN": "Challenging Phase",
    "Content_EN": "Old grudges from the past, Today we meet, showing bad karma, Recite good scriptures often, Pray to protect the women in your home.",
    "Detail2_EN": "You may have made enemies in the past, and these conflicts will resurface when you meet again. The other person might seek revenge. You must recite scriptures and dedicate the merit to your family, especially the women, as they may be targeted. Stay kind-hearted and avoid harsh words—this will turn misfortune into fortune. Be especially careful around the full moon.",
    "Story_EN": "The Strategist",
    "Story_Brief_EN": "A strategist completed his studies, descended the mountain, helped his state defeat a powerful enemy, and gained great fame.",
    "Items_EN": "Career: Very Favorable; Wealth: Great Profit; Achievement: Prominent"
  },
  {
    "number": 22,
    "Level": "上吉",
    "Content": "碧玉池中开白莲，庄严色相自天然，生来骨格超凡俗，正是人间第一仙。",
    "Detail1": "此签主潇洒出尘之应。谋望须清高门路方可。一切财利尘俗事。不甚相宜。功名可许。当主翰苑清品。问孕恐涉空花。问病者。有意参玄学道则吉。佳世之人。亦恐辞座之忌。语皆着空故也。",
    "Detail2": "池中白莲有出污泥而不染的清高之象，高贵清严的外表更是自然天成，但也有孤立清高之意，虽然白天是欣欣向荣的感觉，但到了晚上，则所有花都休息了，有无法持久的意思。天生与众不同，在别人眼中是相当特异独行的，如果是高官贵族，则此签有荣升之意，如果是一般的平凡百姓，表示口出空言，只有表面好看，其实内在相当空洞，要注意。如果是修道之人，则得道之日已不远了。",
    "Story": "李广射石",
    "Story_Brief": "李广误将石头当虎,一箭射入石中,显示其勇武。",
    "Items": "事业:勇进;求财:有;疾病:愈",
    "Level_EN": "High Resonance",
    "Content_EN": "White lotus blooms in jade pool, Noble beauty from nature, Born with extraordinary character, Truly the first immortal among mortals.",
    "Detail2_EN": "The white lotus rises from mud unstained, naturally noble and pure, but also isolated and aloof. Though it flourishes by day, all flowers rest at night, suggesting it cannot last. You're naturally different, seen as unique by others. For nobles, this means promotion. For commoners, it means empty words—beautiful on the surface but hollow inside. For those on the spiritual path, enlightenment is near.",
    "Story_EN": "The Archer",
    "Story_Brief_EN": "A warrior mistook a stone for a tiger, shot an arrow that pierced the stone, showing his extraordinary courage.",
    "Items_EN": "Career: Bold Advance; Wealth: Promising; Health: Recovery"
  },
  {
    "number": 23,
    "Level": "下下",
    "Content": "花开花谢在春风，贵贱穷通百岁中，羡子荣华今已矣，到头万事总成空。",
    "Detail1": "此签主前运起跌不常。富贵穷通。都经涉历。后运则大不吉。如百花已经开过。从今摇落。无复荣华之望。是以万事成空。总宜退谢。倘更勉强图谋。徒劳罔功。终欠结果。",
    "Detail2": "人生运势有好有坏，当好运来临时，却像风中花朵，轻易就被吹落，而坏运却紧追而来，一切的富贵穷通早已在你的人生中经历过了，但是荣华富贵早已流逝，不再回头。如果能看透这一点，则较能释怀，若是强求，也只是徒劳无功，不可能有收获的，及早认清事实。",
    "Story": "韩愈谏佛骨",
    "Story_Brief": "韩愈上表谏迎佛骨,被贬潮州,但坚持正道。",
    "Items": "功名:有阻;求财:平;诉讼:不利",
    "Level_EN": "Challenging Phase",
    "Content_EN": "Flowers bloom and fade in spring wind, Rich and poor in a hundred years, Your glory has passed, All things end in emptiness.",
    "Detail2_EN": "Life's fortunes rise and fall. When good fortune comes, it's like flowers in the wind—easily blown away. Bad fortune follows closely. You've already experienced all the ups and downs of wealth and poverty in your life. Glory and honor have passed and won't return. If you can see this clearly, you'll find peace. If you force things, it's futile—you'll gain nothing. Face reality early.",
    "Story_EN": "The Advisor",
    "Story_Brief_EN": "A scholar advised against welcoming a Buddhist relic, was exiled, but remained true to his principles.",
    "Items_EN": "Achievement: Obstacles; Wealth: Moderate; Legal: Unfavorable"
  },
  {
    "number": 24,
    "Level": "中吉",
    "Content": "一春万事苦忧煎，夏里营求始帖然，更遇秋成冬至后，恰如骑鹤与腰缠。",
    "Detail1": "此签先难后易。官员占之。有超擢之喜。士人占之。晚成名利。凡百谋望。收成在后。近占应在夏秋冬。远占应在晚景。不可因现在忧煎。自行堕志也。",
    "Detail2": "事情的开始，总是较为艰难，或许会有重重险阻，只要立定志向，贯彻始终，最后的收成，会比自己想象得要容易，只要不放弃，必能达成目标，此签也表示出了节令，在春天则无法成事，到了夏天则较可为，如果是秋天到冬天，则绝对会成功，此签更有名利双收的表示，只要坚持到底，成功绝对没有问题。",
    "Story": "张骞通西域",
    "Story_Brief": "张骞出使西域,历经艰险,开辟丝绸之路。",
    "Items": "事业:远行;求财:有;婚姻:待时",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Spring brings worry and hardship, Summer begins to settle, Autumn and winter bring success, Like riding a crane with gold at your waist.",
    "Detail2_EN": "The beginning is always hardest, with many obstacles. But if you stay determined and see it through, the final harvest will be easier than expected. Don't give up—you'll achieve your goal. This sign also indicates timing: spring brings no success, summer is better, and autumn to winter brings absolute success. This sign promises both fame and fortune. Persevere to the end—success is certain.",
    "Story_EN": "The Pathfinder",
    "Story_Brief_EN": "An envoy journeyed to the western regions, faced great dangers, and opened the Silk Road.",
    "Items_EN": "Career: Travel; Wealth: Promising; Relationships: Await Timing"
  },
  {
    "number": 25,
    "Level": "中平",
    "Content": "寅午戌年多阻滞，亥子丑月渐亨嘉，待逢玉兔金鸡会，枯木逢春自放花。",
    "Detail1": "此签作事迟疑。至三冬谋望亨通。卯酉月日。应在次年。或应在远年。枯木开花。言时运先蹇后泰。如秋冬枯落之木。一到春来。开花结果。自有一番更新气象。后福未可量也。",
    "Detail2": "在处理事务上，总是出现许多的迟疑，原来是受到时令的影响。此签最主要是显示出时令，当遇到虎、马、狗年时，诸事不顺，多受阻滞，但在每年的冬季时，则运势会转好，春夏秋季时则完全不行，当遇到兔及鸡年时，会有枯木开花的荣景，也就是原本已不看好，但却重现生机及活力，而且会有一番新的景象，由衰转荣，而且后福不浅，会完全抛掉衰运。",
    "Story": "唐明皇游月宫",
    "Story_Brief": "唐明皇梦游月宫,得见仙女,但终因安史之乱而失势。",
    "Items": "婚姻:虚;求财:无;事业:先盛后衰",
    "Level_EN": "Neutral Path",
    "Content_EN": "Tiger, horse, dog years bring obstacles, Winter months gradually improve, When rabbit and rooster meet, Withered wood blooms in spring.",
    "Detail2_EN": "You've been hesitant in handling affairs, influenced by the seasons. This sign shows timing: in tiger, horse, or dog years, everything goes wrong with many obstacles. But in winter each year, fortune improves. Spring, summer, and autumn won't work. In rabbit or rooster years, withered wood will bloom—what seemed hopeless will regain life and vitality, bringing a new beginning. From decline to prosperity, with lasting blessings ahead.",
    "Story_EN": "The Dreamer",
    "Story_Brief_EN": "An emperor dreamed of visiting the moon palace and meeting fairies, but eventually lost power due to rebellion.",
    "Items_EN": "Relationships: Empty; Wealth: Limited; Career: Prosper Then Decline"
  },
  {
    "number": 26,
    "Level": "中吉",
    "Content": "年来丰歉皆天数，祇是今年旱较多，与子定期三日内，田畴沾足雨滂沱。",
    "Detail1": "此签谋事。先损后遂。问病。星运未顺。三日后或遇庚日。可望痊可。所谓先庚三日。后庚三日也。讼即解。利即得。婚即成。行人三日内必至。祷雨三日内必降。凡事利达也。",
    "Detail2": "庄稼的丰收与歉收，完全都是由天决定，这是天地间的常理，无法由人力来改变。意谓着运势的好坏，并非靠努力就可转运，还是必须等待时机的到来。适逢今年运劫不佳，遇到了干旱年，收成势必会有影响，此签表示出了时间签，肯定在三天内会久旱逢甘霖，三天也表示很快的意思，让田里的庄稼有足够的雨水，也表示衰运从此终结，开始顺遂的好运道。",
    "Story": "桓公得管仲",
    "Story_Brief": "齐桓公不计前嫌,重用管仲,终成春秋五霸之首。",
    "Items": "事业:得贤;求财:大利;功名:显",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Harvest and drought are heaven's will, This year brings more drought, I promise you within three days, Fields will be soaked with rain.",
    "Detail2_EN": "Whether crops flourish or fail is entirely up to heaven—this is natural law, beyond human control. Fortune's rise and fall can't be changed by effort alone—you must wait for the right time. This year's fortune is poor, like a drought year, affecting your harvest. This sign shows timing: within three days, the long drought will end with abundant rain. The fields will be soaked, meaning your bad fortune ends and good fortune begins.",
    "Story_EN": "The Wise Ruler",
    "Story_Brief_EN": "A wise ruler forgave past wrongs, trusted a talented minister, and became the first of five great rulers.",
    "Items_EN": "Career: Get Talent; Wealth: Great Profit; Achievement: Prominent"
  },
  {
    "number": 27,
    "Level": "中平",
    "Content": "世间万物各有主，一粒一毫君莫取，英雄豪杰自天生，也须步步循规矩。",
    "Detail1": "此签只宜守分。不可妄为。若谋事返成灾害。不可以大凌小。以富欺贫。讼宜和。名亦有。财缓求。行人阻。病徐安。婚莫急。凡事守己。待时为得。",
    "Detail2": "天地间的万事万物，各有其所，不可因其小而取之，不可因其弱而欺之，身为英雄豪杰，自有气势风范，不可因此而欺负弱小，更要收敛自己的气势，固守本分。不该是自己的东西，千万不要贪得，必须循规蹈矩，成为众人赞赏的对象，必有后福。此签主要告诫世人安分守己、不可妄为，也有等待最佳时机到来之意。",
    "Story": "李密陈情",
    "Story_Brief": "李密上《陈情表》,以孝感动晋武帝,得以侍奉祖母。",
    "Items": "婚姻:孝为先;求财:有;事业:待时",
    "Level_EN": "Neutral Path",
    "Content_EN": "Everything in the world has its owner, Take not a grain or a thread, Heroes are born, not made, But must still follow the rules step by step.",
    "Detail2_EN": "Everything in the world has its place. Don't take what's small, don't bully the weak. As a hero, you have natural charisma, but don't use it to oppress others. Control your power and stay in your place. Don't covet what isn't yours. Follow the rules and become someone others admire. Good fortune will follow. This sign warns you to stay in your place and not act recklessly. It also means waiting for the right time.",
    "Story_EN": "The Filial Son",
    "Story_Brief_EN": "A filial son wrote a moving petition to the emperor, moved him with his devotion, and was allowed to care for his grandmother.",
    "Items_EN": "Relationships: Filial Piety First; Wealth: Promising; Career: Await Timing"
  },
  {
    "number": 28,
    "Level": "上吉",
    "Content": "公侯将相本无种，好把勤劳契上天，人事尽从天里见，才高岂得困林泉。",
    "Detail1": "此签吉利。凡事切莫堕志。更须修心向善。自有好处。问讼久方决。名利稍迟。失物可寻。病宜作福禳解。行人久后必至。",
    "Detail2": "人世间的功名利禄，并非从天而降，只要辛勤地努力，必能达到，并没有限制在这达官贵族之家，任何人都可以因为勤劳及努力，而得到该有的回馈。所谓的“尽人事，听天命”，当你辛苦努力地往上爬，上天岂有看不见的道理，才德及能力是无法被压抑的，总有出头天的时候，任何事情都是一样，只要努力在先，没有被忽略的道理，所以要先要求自己，就会有出人头地的一天。",
    "Story": "吕后专权",
    "Story_Brief": "吕后专权,残害刘氏,但最终被铲除,汉室得以延续。",
    "Items": "事业:防小人;求财:无;婚姻:凶",
    "Level_EN": "High Resonance",
    "Content_EN": "Nobles aren't born, they're made, Work hard and heaven will see, Do your best, heaven will help, Talent won't be trapped in obscurity.",
    "Detail2_EN": "Fame and fortune don't fall from the sky. Through hard work, anyone can achieve them—not just nobles. Anyone can earn rewards through diligence and effort. As the saying goes, 'Do your best and leave the rest to heaven.' When you work hard to rise, how can heaven not see? Your talent won't be wasted in obscurity. This sign encourages you to work hard—success will come naturally.",
    "Story_EN": "The Usurper",
    "Story_Brief_EN": "A powerful woman seized control, harmed the royal family, but was eventually removed, allowing the dynasty to continue.",
    "Items_EN": "Career: Beware Deceit; Wealth: Limited; Relationships: Challenging"
  },
  {
    "number": 29,
    "Level": "上吉",
    "Content": "祖宗积德几多年，源远流长庆自然，若更操修无倦己，天须还汝旧青毡。",
    "Detail1": "此签士人占之大吉。官员占之高擢。庶人占之终有发达。但要修心积善。方得源远流长。不可变易祖德。自损心田。则亦有不应之时也。",
    "Detail2": "从以前到现在，都是顺利如意的，不像别人历经大风大浪，这一切的吉运，是来自于祖宗的积德，经过长时间的累积，到了你这一代才得以受到福荫，福运的流传，是得自于天理自然，所以必须更知道珍惜，将这份善心加以延长，谨慎操守，让福份能更加绵长，未来也将更加顺遂。千万不可因好运，而肆无忌惮地挥霍，将会招来厄运。",
    "Story": "柳毅传书",
    "Story_Brief": "柳毅为龙女传书,助其脱离苦海,后与龙女结为夫妻。",
    "Items": "婚姻:成;求财:有;事业:得助",
    "Level_EN": "High Resonance",
    "Content_EN": "Ancestors' virtue accumulated over years, Blessings flow like a long river, If you continue to cultivate without rest, Heaven will restore your former glory.",
    "Detail2_EN": "You've been smooth and successful, unlike others who face storms. This good fortune comes from your ancestors' accumulated virtue over many generations, finally blessing you in this life. This blessing flows naturally from heaven. You must cherish it and extend this kindness, continuing to do good. If you maintain this virtue, heaven will restore your family's former glory. This is a sign of inherited blessings—cherish and continue them.",
    "Story_EN": "The Messenger",
    "Story_Brief_EN": "A messenger helped a dragon princess escape suffering by delivering a letter, and later married her.",
    "Items_EN": "Relationships: Favorable; Wealth: Promising; Career: Get Help"
  },
  {
    "number": 30,
    "Level": "中吉",
    "Content": "奉公谨守莫欺心，自有亨通吉利临，目下营求且休矣，秋期与子定佳音。",
    "Detail1": "此签目下不宜妄取。只宜守己。官员占之。必有忧疑。若能谨守。自有佳音。士人占之。且待时来。飞腾有日。庶人占之。平安。凡有谋望。先难后易。不可躁进。安分守己。交秋自有遇合。",
    "Detail2": "现在周围有些许的诱惑，你必须心存正念，不可受到影响，在自己的岗位上奉公守法，未来自有吉运降临。目前有许多欲望在内心挣扎，时机还未成熟，倒不如先放下净空，到了秋天必会有好运到来。此签表示现在正陷入一种内心交战的状态，你越想得到，就越无法达成，只要从心做起，不求回报，自会有福德来临，未来会有苦尽甘来的收获。",
    "Story": "马援征交趾",
    "Story_Brief": "马援南征交趾,立铜柱为界,功成名就。",
    "Items": "事业:成功;求财:有;功名:显",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Serve with integrity, don't deceive, Good fortune will naturally come, Put aside current pursuits, Autumn will bring you good news.",
    "Detail2_EN": "There are temptations around you now. Stay true to your principles and don't be influenced. Serve honestly in your position, and good fortune will come naturally. Many desires struggle within you, but the timing isn't right. It's better to let go and clear your mind. By autumn, good fortune will arrive. This sign shows you're in internal conflict. Stay honest and wait—autumn will bring the answer.",
    "Story_EN": "The Conqueror",
    "Story_Brief_EN": "A general led a southern expedition, established boundaries with bronze pillars, and achieved great fame.",
    "Items_EN": "Career: Success; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 31,
    "Level": "中吉",
    "Content": "秋冬作事只寻常，春到门庭渐吉昌，千里信音符远望，萱堂快乐未渠央。",
    "Detail1": "此签秋冬平平。一切事宜。交春方有起色。千里好音。是时可至。高堂白发。尤保康宁。守己待时。吉无不利。",
    "Detail2": "想要执行的事，在秋冬季是不会有太多回应的，只能以平凡来形容，但到了春季就不同了，可以感受到明显的好运到来，而且会得到远方来的好消息，而且有所成就，高堂上的老母因此感到无比的快乐，而且福寿双全。此签虽然表示秋冬只是平常，但依然要十分的努力，到了春天才会有回收，如果因此而不努力，再好的运势也是罔然。",
    "Story": "苏武牧羊",
    "Story_Brief": "苏武出使匈奴,被扣留十九年,持节不屈,终得归汉。",
    "Items": "事业:坚持;求财:无;婚姻:待时",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Autumn and winter bring only ordinary results, Spring arrives at your door with good fortune, News comes from a thousand miles away, Mother's joy knows no bounds.",
    "Detail2_EN": "What you want to do won't get much response in autumn and winter—it will be ordinary. But spring is different—you'll feel clear good fortune. You'll receive good news from afar and achieve success. Your mother will be overjoyed and blessed with both fortune and longevity. Though this sign shows timing, it also means you must wait. Don't rush—spring will bring everything you need.",
    "Story_EN": "The Loyal",
    "Story_Brief_EN": "An envoy was held captive for nineteen years, remained loyal, and finally returned home.",
    "Items_EN": "Career: Perseverance; Wealth: Limited; Relationships: Await Timing"
  },
  {
    "number": 32,
    "Level": "下下",
    "Content": "劳心汩汩竟何归，疾病兼多是与非，事到头来浑似梦，何如休要用心机。",
    "Detail1": "此签谋事皆不如意。主口舌之扰。事虽有成。终必有败。空劳心力。只有安分。不可妄为。",
    "Detail2": "平常待人处事都是用尽心机，而且以私利为前题，太过耗费心力的结果，却无法有好的回报，连带的疾病缠身，且引起口舌是非，最后还是一身空，想要解这个危机，必须从心做起，放下私利的心，一切向善，多作有益他人的事，必能挽回颓势。修心还要修口，谨防口舌带来的是非，必能转回好运。",
    "Story": "刘备借荆州",
    "Story_Brief": "刘备借荆州不还,与东吴结怨,后引发夷陵之战。",
    "Items": "求财:借难还;婚姻:不利;事业:有阻",
    "Level_EN": "Challenging Phase",
    "Content_EN": "All your scheming leads nowhere, Illness and disputes follow, Everything ends like a dream, Why not stop using your wits?",
    "Detail2_EN": "You've been scheming in all your dealings, putting self-interest first. Exhausting yourself brings no good return—only illness and disputes. In the end, you have nothing. To resolve this crisis, start from the heart. Let go of self-interest, turn toward goodness, and do things that help others. Only then will you find peace and avoid disaster. This sign warns against excessive scheming—simplicity and honesty are the way.",
    "Story_EN": "The Borrower",
    "Story_Brief_EN": "A ruler borrowed a territory and didn't return it, creating enmity that later led to war.",
    "Items_EN": "Wealth: Hard to Repay; Relationships: Unfavorable; Career: Obstacles"
  },
  {
    "number": 33,
    "Level": "中吉",
    "Content": "不分南北与西东，眼底昏昏耳似聋，熟读黄庭经一卷，不论贵贱与穷通。",
    "Detail1": "此签不宜妄想。只宜谨守避祸。作福修善。自有神助。失意反成得意。无望反成有望。若贪图躁进。不唯无益。更恐反遭不测。占者慎之。",
    "Detail2": "分不清东西南北，眼睛看不清楚，耳朵也听不到，表示不受外在环境的影响，只管自己的事，则可保平安。若多管闲事，则会招来厄运，而且会殃及池鱼，必须要很小心，明明与自己无关的事，却会惹来一身麻顺。不如修养身息，不问俗事，不管贫富贵贱，平心处之，则可避祸。此时不宜急进，必须退守，动则招祸。",
    "Story": "孔融让梨",
    "Story_Brief": "孔融四岁让梨,以孝悌闻名,后成为名士。",
    "Items": "婚姻:和;求财:有;事业:顺利",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Can't tell north, south, east, or west, Eyes dim, ears deaf, Read the Yellow Court Classic well, Whether noble or common, rich or poor.",
    "Detail2_EN": "You can't distinguish directions, see clearly, or hear well—meaning you're unaffected by the outside world. Focus on your own affairs, and you'll stay safe. If you meddle in others' business, you'll invite misfortune and harm others. Be very careful—things that have nothing to do with you will cause trouble. Better to cultivate yourself, stay quiet, and avoid unnecessary involvement. This sign warns against meddling.",
    "Story_EN": "The Humble",
    "Story_Brief_EN": "A child shared pears with his brothers at age four, became known for filial piety, and later became a famous scholar.",
    "Items_EN": "Relationships: Harmonious; Wealth: Promising; Career: Smooth"
  },
  {
    "number": 34,
    "Level": "中吉",
    "Content": "春夏才过秋又冬，纷纷谋虑搅心胸，贵人垂手来相接，休把私心情意浓。",
    "Detail1": "此签谋望难成。徒劳心力。幸有贵人接引。必须托以心腹。不得又听邪佞之言。私心拟议。进退不决。失此机会也。",
    "Detail2": "至少已经持续一年了，在你心里不上不下，无法解决，就这样日复一日，时间越拖越久，心里越磨越烦，总是无法处理，好不容易有贵人出现，你必须敞开胸怀，真心以待，才能解决。如果你心存怀疑，又加上道听涂说，让自己犹豫不决，只是会失去这个机会，让自己陷入深渊之中。目前出现的贵人是相当可信的，不要失去这个可贵的机会，则会有所成。",
    "Story": "姜维九伐中原",
    "Story_Brief": "姜维继承诸葛亮遗志,九次北伐,但终因国力不济而失败。",
    "Items": "事业:劳而无功;求财:无;功名:难成",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Spring and summer pass, autumn and winter come, Many worries trouble your heart, A noble person reaches out to help, Don't let selfish feelings cloud your judgment.",
    "Detail2_EN": "For at least a year, you've been stuck, unable to resolve things. Day after day, time drags on, and your heart grows more troubled. You can't handle it. Finally, a noble person appears. You must open your heart and treat them sincerely to resolve this. If you're suspicious and listen to rumors, you'll miss this opportunity. Trust the noble person—they'll help you solve everything.",
    "Story_EN": "The Perseverant",
    "Story_Brief_EN": "A general inherited his master's will, launched nine northern campaigns, but ultimately failed due to insufficient resources.",
    "Items_EN": "Career: Labor Without Result; Wealth: Limited; Achievement: Hard to Achieve"
  },
  {
    "number": 35,
    "Level": "下下",
    "Content": "一山如画对清江，门里团圆事事双，谁料半途分折去，空帏无语对银缸。",
    "Detail1": "此签先吉后凶。有始无终。防有盗贼之侵。死亡之虑。夫妻折散之忧。亲友嫌隙之咎。主家业退败。人口凋零。大凶之兆。急须种德挽回。庶可化凶为吉也。",
    "Detail2": "阴宅方位得山得水，是不错的风水，目前家庭幸福、工作顺利，但天有不测风云，谁都无法预期到突然间会有巨大的变化，不只家道中落，还会有生离死别之苦，未来的凄凉之状，令人垂泪，及早面对如此的灾祸。此劫是无法避免的，虽然目前还是如意的状态，也只是风雨前的宁静，尽早预防，可减少伤害，天理循环，非你我可改。",
    "Story": "王祥卧冰",
    "Story_Brief": "王祥为继母卧冰求鲤,以孝感动天地。",
    "Items": "婚姻:孝为先;求财:有;事业:待时",
    "Level_EN": "Challenging Phase",
    "Content_EN": "A painted mountain faces clear river, Family united, everything doubled, Who knew halfway it would break apart, Empty room, silence, facing the silver lamp.",
    "Detail2_EN": "Your home has good feng shui—mountain and water. Currently, your family is happy and work is smooth. But heaven is unpredictable. No one expected such a sudden, huge change. Not only will your family decline, but you'll face separation and death. The future looks bleak and tearful. Face this disaster early—it cannot be avoided. Prepare your heart and accept it.",
    "Story_EN": "The Devoted",
    "Story_Brief_EN": "A filial son lay on ice to catch fish for his stepmother, moved heaven and earth with his devotion.",
    "Items_EN": "Relationships: Filial Piety First; Wealth: Promising; Career: Await Timing"
  },
  {
    "number": 36,
    "Level": "上吉",
    "Content": "功名富贵自能为，偶着先鞭莫问伊，万里鹏程君有分，吴山顶上好钻龟。",
    "Detail1": "此签不可躁进。欲速则不达也。功名富贵。迟速有时。待时而动则吉。鹏程有分。定可达到。名必成。财必遂。运程坦坦。转瞬扬眉吐气时也。",
    "Detail2": "经过长时间的努力，功名利禄自然而成，看着别人总是先驰得点，也不必太忌妒，事有先后，不见得先努力就会先成功，每个人的机运不同，但此签表示成就会较迟，并非不成，所以不必心急，默默努力，终会功成名就，急躁则会坏事。虽然现在显得辛苦，但晚景必定顺遂，为了未来的享乐，只好现在辛苦点了。",
    "Story": "范蠡归隐",
    "Story_Brief": "范蠡助越王灭吴后,功成身退,泛舟五湖,成为商圣。",
    "Items": "事业:功成身退;求财:大利;婚姻:成",
    "Level_EN": "High Resonance",
    "Content_EN": "Fame and fortune come naturally, Don't envy those who start first, You have a share of great success, On Mount Wu, divine the turtle shell.",
    "Detail2_EN": "After long effort, fame and fortune will come naturally. Don't be jealous of those who succeed first. Things happen in order—not everyone who starts first finishes first. Everyone's timing is different. This sign shows your success will come later, not that it won't come. Don't be impatient. Work quietly, and you'll achieve fame and success. Impatience will only bring failure.",
    "Story_EN": "The Wise Retiree",
    "Story_Brief_EN": "A strategist helped a king defeat an enemy, then retired and sailed the lakes, becoming a legendary merchant.",
    "Items_EN": "Career: Retire After Success; Wealth: Great Profit; Relationships: Favorable"
  },
  {
    "number": 37,
    "Level": "中吉",
    "Content": "焚香来告复何辞，善恶平分汝自知，屏却昧公心里事，出门无碍是通时。",
    "Detail1": "此签显然告人迁善去恶。秉心公正。自有通达之时。若不觉悟改悔。鬼神暗里先知。何能掩蔽。恐不免咎殃之踵至也。",
    "Detail2": "何必求神问卜才能知善恶，是非进退自在人心，你心理自有尺度，什么是对、什么是错，公理自在人心。若要人不知，除非己莫为，不可因为他人不知而为之，必须心存善念，不可有害人之心，因利己而损人，将会招来厄运，一旦排除了利己之心，一切所为皆为公正，不论何处，都能畅行无阻。",
    "Story": "李靖平突厥",
    "Story_Brief": "李靖率军平定突厥,功勋卓著,成为一代名将。",
    "Items": "事业:大吉;求财:有;功名:显",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Why ask when you burn incense, You know good from evil yourself, Cast aside dark thoughts in your heart, Step outside, all paths are open.",
    "Detail2_EN": "Why ask the gods to know good from evil? Right and wrong are in your own heart—you know the measure. What's right, what's wrong—justice is in people's hearts. If you want no one to know, don't do it. Don't do wrong just because others don't know. Keep good thoughts, don't harm others, don't benefit yourself at others' expense—this brings misfortune. Once you clear your heart of dark thoughts, all paths open.",
    "Story_EN": "The General",
    "Story_Brief_EN": "A general led an army to pacify the northern tribes, achieved great merit, and became a famous commander.",
    "Items_EN": "Career: Very Favorable; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 38,
    "Level": "下下",
    "Content": "吟蛩唧唧守孤帏，千里悬悬望信归，等得荣华公子到，秋冬括括雨霏霏。",
    "Detail1": "此签主有死亡之患。哭泣之哀。凡事不利。有名无实。有始无终。家运凋零。前程蹇滞。作大阴功善事可解。",
    "Detail2": "独守孤帏，只有虫声唧唧，是多么凄凉的景象啊！只有靠着心中的意念维生，盼望着远方的他能有好消息，好不容易等到了衣锦荣归的伊人，却又如梦一场，是那么短暂，秋风愁雨，苦不堪言，令人哀凄。此签是如此地悲苦，一切的厄运如影随形，挥之不去。此时不宜有任何的决定，不如坚守本位，以不变应万变，静待世局的变化，再苦的运势，就当作是上天给你的磨练。",
    "Story": "陶渊明归隐",
    "Story_Brief": "陶渊明不为五斗米折腰,归隐田园,成为隐逸诗人之宗。",
    "Items": "事业:不仕;求财:淡泊;婚姻:成",
    "Level_EN": "Challenging Phase",
    "Content_EN": "Crickets chirp in lonely room, Waiting anxiously for news from afar, When the noble son returns in glory, Autumn and winter bring cold rain.",
    "Detail2_EN": "Alone in your room, only cricket sounds—how desolate! You survive on hope, waiting for good news from far away. Finally, you wait for the one who returns in glory, but it's like a dream—so brief. Autumn wind and cold rain bring unbearable sorrow. This sign shows such sadness—one disappointment after another. Don't expect too much, or you'll only hurt more. Accept reality and find peace within.",
    "Story_EN": "The Poet Hermit",
    "Story_Brief_EN": "A poet refused to bow for a small salary, retired to the countryside, and became the master of reclusive poetry.",
    "Items_EN": "Career: Not Seeking Position; Wealth: Contentment; Relationships: Favorable"
  },
  {
    "number": 39,
    "Level": "中平",
    "Content": "北山门外好安居，若问终时慎厥初，堪笑包藏许多事，鳞鸿虽便莫修书。",
    "Detail1": "此签宜守旧。不可妄为。作事谋始。无贻后悔。凡事谨密为要。不可浪透信息。反此。则有意外之咎。",
    "Detail2": "目前处于安乐生活，有点远离尘嚣的状态。若想知道最后的结果，倒不如从最初开始就及早规划，则会有美好的未来。你知道的事情相当多，但千万不可走漏消息，尤其是有人向你打探消息，不如一笑置之，免得招来祸患。更谨防书信上的泄密，不可有‘别人不会知道’的心态，倒不如什么都不说，将可保有安居乐业的生活。",
    "Story": "商鞅变法",
    "Story_Brief": "商鞅在秦国变法,使秦强盛,但最终被车裂而死。",
    "Items": "事业:先成后败;求财:有;功名:凶",
    "Level_EN": "Neutral Path",
    "Content_EN": "Good to live outside the north gate, If asking about the end, be careful from the start, Laugh at all the hidden things, Though messages are easy, don't write.",
    "Detail2_EN": "You're living a peaceful life now, somewhat removed from the world. If you want to know the final outcome, plan carefully from the beginning for a good future. You know many things, but don't leak information, especially when people probe. Better to laugh it off to avoid trouble. Be especially careful with letters and messages—don't write them, or you'll invite disaster. This sign warns against revealing secrets.",
    "Story_EN": "The Reformer",
    "Story_Brief_EN": "A reformer changed the laws in a kingdom, made it strong, but was eventually executed.",
    "Items_EN": "Career: Succeed Then Fail; Wealth: Promising; Achievement: Challenging"
  },
  {
    "number": 40,
    "Level": "上吉",
    "Content": "新来换得好规模，何用随他步与趋，只听耳边消息到，崎岖历尽见亨衢。",
    "Detail1": "此签谋望尽好。须是自己变更。莫听人言主使。误走程途。不久好音即到。始虽崎岖难行。后自亨衢通利。是为先难后易之象。",
    "Detail2": "随自己的意愿做改变，将是最好的选择，不须受他人的影响，他人的危言耸听，将使你误入歧述，要谨防受影响。即将有好消息的到来，尽管经历过重重坎坷，接踵而来的将是康庄大道，先苦后甘。此签表示先难后易之象，但最重要的是不要被别人的意见所左右，只要依自己的意愿做个大改变，将会有美好的未来。",
    "Story": "汉光武中兴",
    "Story_Brief": "刘秀起兵恢复汉室,建立东汉,实现中兴。",
    "Items": "事业:大吉;求财:有;功名:显",
    "Level_EN": "High Resonance",
    "Content_EN": "New changes bring better structure, No need to follow others' steps, Just listen for news in your ear, After rough roads, see the smooth path.",
    "Detail2_EN": "Making changes according to your own will is best. Don't be influenced by others—their alarmist words will lead you astray. Be careful not to be affected. Good news is coming soon. Despite many hardships, a smooth road awaits. This is bitter first, sweet later. This sign shows difficulty first, then ease. Most importantly, trust yourself and don't follow others blindly.",
    "Story_EN": "The Restorer",
    "Story_Brief_EN": "A prince raised an army to restore the dynasty, established a new empire, and achieved restoration.",
    "Items_EN": "Career: Very Favorable; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 41,
    "Level": "上吉",
    "Content": "自南自北自东西，欲到天涯谁作梯，遇鼠逢牛三弄笛，好将名姓榜头题。",
    "Detail1": "此签主事务目前多处于变动与不确定中。讼必反复，婚有变易。功名初年艰难，但遇子丑（鼠牛）月日或年份，则有青云直上之势。凡事先难后易，需尽人事以待天时，最终必能扬眉吐气。",
    "Detail2": "你正处于一个四处奔波、寻找出路的阶段，仿佛走到了天涯海角，却苦于没有登天的梯子。这种迷茫与崎岖是暂时的。等到鼠牛交替的时节（子丑之期），你会得到意想不到的转机或贵人提携，就像在荒野中听到悠扬的笛声，指引你走向康庄大道。届时，你的名字将会出现在成功的榜单上，所有的努力都会得到回报。",
    "Story": "张骞寻源",
    "Story_Brief": "汉代张骞奉命寻找黄河之源，他孤身深入西域，历尽艰险，最终不仅找到了水源，更开辟了丝绸之路，成就了流传千古的伟业。",
    "Items": "感情:会有转机;财富:先难后丰;远行:必有收获",
    "Level_EN": "High Resonance",
    "Content_EN": "From south, north, east, and west, Who will be the ladder to the sky? When rat meets ox, three flutes play, Your name will top the list.",
    "Detail2_EN": "You're in a phase of constant movement, searching for a way out. You've reached the ends of the earth but lack a ladder to the sky. This confusion and hardship is temporary. When the rat and ox meet (the transition period), you'll get an unexpected opportunity. Your name will be written at the top—success is near. This sign shows that persistence through difficulty leads to breakthrough.",
    "Story_EN": "The Pathfinder",
    "Story_Brief_EN": "An envoy was sent to find the source of the Yellow River. Alone, he journeyed deep into the western regions, faced great dangers, found the source, and opened the Silk Road, achieving eternal glory.",
    "Items_EN": "Love: Turnaround Coming; Wealth: Difficult Then Prosperous; Travel: Reward Assured"
  },
  {
    "number": 42,
    "Level": "中吉",
    "Content": "我曾许汝事和谐，谁料修为果自乖，但改新图莫依旧，营谋应得称心怀。",
    "Detail1": "此签宜反己问心。毋乖神意。恐有恶事恶念。急须改悔。前次所谋不合。从此更新整顿。自有称心之时。若怙恶不悛。及畏难苟安者。则无济也。",
    "Detail2": "原本神明给你一个顺遂和谐的道路，但因自以为是的个性，将天助好意破坏掉了，而且还怀有不好的念头，在还没害人之前，就会先害到自己，还是尽快将歹念去除，重新立定目标，只要没有害人之心，未来更将得心应手，运势得以否极泰来。不管任何事，都有除旧更新之意。",
    "Story": "王羲之临池",
    "Story_Brief": "王羲之临池学书,池水尽黑,终成书圣。",
    "Items": "功名:成;求财:有;事业:成功",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "I promised you harmony, But your actions went astray, Change your plans, don't follow old ways, New efforts will bring what you desire.",
    "Detail2_EN": "The gods originally gave you a smooth, harmonious path, but your self-righteous nature destroyed this divine help. You've harbored bad thoughts—before harming others, you'll harm yourself. Quickly remove these evil thoughts and set new goals. Don't follow old patterns. With new plans and sincere effort, you'll achieve what you want. This sign warns: change your heart, change your ways.",
    "Story_EN": "The Calligrapher",
    "Story_Brief_EN": "A calligrapher practiced by the pond until the water turned black, eventually becoming the master of calligraphy.",
    "Items_EN": "Achievement: Favorable; Wealth: Promising; Career: Success"
  },
  {
    "number": 43,
    "Level": "中吉",
    "Content": "一纸官书火急催，扁舟东下浪如雷，虽然目下多惊险，保汝平安去复回。",
    "Detail1": "此签先凶后吉。若问谋望。自有好处。病者虑险。自有解脱。讼事惊惶。渐得安泰。宦途主有风浪。终不为害。凡事存心。默仗神佑获吉。",
    "Detail2": "遇到了不可抗拒的因素，必须冒着极大的风险前往，看起来危机四伏，但在神明的保护之下，均能化险为夷，最后平安归来。此签有先凶后吉之象，虽然遇到惊涛骇浪，但都能平安化解，如果不遇到这些危险之事，也无法进入到平安之境，当进入吉运之后，前面所遇的灾难就自动化解消逝了。",
    "Story": "玄奘取经",
    "Story_Brief": "玄奘西行取经,历经九九八十一难,终得真经。",
    "Items": "事业:远行;求财:有;功名:成",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Urgent official letter arrives, Small boat sails east, waves like thunder, Though dangers lie ahead, I'll keep you safe, there and back.",
    "Detail2_EN": "You've encountered irresistible forces and must go despite great risks. It looks dangerous, but under divine protection, all dangers will be overcome, and you'll return safely. This sign shows danger first, then safety. Though you face stormy seas, all will be resolved peacefully. Trust in protection and proceed with courage.",
    "Story_EN": "The Pilgrim",
    "Story_Brief_EN": "A pilgrim journeyed west to obtain scriptures, faced eighty-one trials, and finally succeeded.",
    "Items_EN": "Career: Travel; Wealth: Promising; Achievement: Favorable"
  },
  {
    "number": 44,
    "Level": "中吉",
    "Content": "汝是人中最吉人，误为误作损精神，坚牢一念酬香愿，富贵荣华萃汝身。",
    "Detail1": "此签本非恶人。却有恶事。当由见识不明。及被人引诱所致。未免得罪神明。速宜悉心忏悔。力持善愿。以冀感应。将来富贵有准。荣华可期。唯在一念挽回。毋终执迷自误也。",
    "Detail2": "你本来是个心也善良的人，但在周围引诱之下，做出了错误的事情，不仅胡作非为，还因此伤了自己，赶快重拾善念，用最诚挚的心向神明忏悔，只要回心转念，原本善良的心而重新出发，则能弥补之前的过错，得到神明的帮助，荣华富贵将随即出现。此签要告诉你，知错能改，善莫大焉。",
    "Story": "周瑜火烧赤壁",
    "Story_Brief": "周瑜用火攻大败曹操,奠定三国鼎立基础。",
    "Items": "事业:大吉;求财:有;功名:显",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "You are the most blessed among men, But mistakes have hurt your spirit, Hold fast to your vow, fulfill your promise, Wealth and honor will gather around you.",
    "Detail2_EN": "You're naturally kind-hearted, but under temptation, you've made mistakes. You've acted wrongly and hurt yourself. Quickly return to goodness, repent sincerely to the gods with the most earnest heart. Once you turn back, your original kind heart will be restored, and wealth and honor will gather around you. This sign shows redemption is possible—return to your true nature.",
    "Story_EN": "The Tactician",
    "Story_Brief_EN": "A strategist used fire to defeat a powerful enemy, establishing the foundation for three kingdoms.",
    "Items_EN": "Career: Very Favorable; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 45,
    "Level": "中吉",
    "Content": "好将心地力耕耘，彼此山头总是坟，阴地不如心地好，修为到底却输君。",
    "Detail1": "此签劝人竭力存心。中心为忠。如心为恕。凡事人己两平。不可为损人利己。及欺心谋吉之事。心地好时。自沐天心庇荫。发福悠长。彼谋吉者。欲得阴地。先损心地。计亦左矣。岂能及存心者之万一乎。",
    "Detail2": "有人为了求得好运，总是在阴宅上处心积虑，希望求得一块福地，能够旺子孙、旺家业，但却忘了修好心田，如果只是一昧地找好阴地，但心地却有损人利己之念，最后阴地还是会输给心之地的。此签是要人从心做起，只要心中有善念，不蓄意为恶，就像是一块良田，在心中滋长，为人们带来最大的善报。",
    "Story": "司马相如求凰",
    "Story_Brief": "司马相如以《凤求凰》打动卓文君,两人私奔,终成佳话。",
    "Items": "婚姻:成;求财:有;事业:顺利",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Better to cultivate the heart, All mountains end in graves, Good burial ground can't match a good heart, In the end, virtue wins.",
    "Detail2_EN": "Some people obsess over finding good burial sites to bring fortune to descendants and family, but forget to cultivate a good heart. If you only seek good burial grounds but harbor thoughts of harming others for personal gain, the burial ground will lose to a good heart. Cultivate virtue first—this is the true foundation of fortune. This sign teaches: inner virtue matters more than external arrangements.",
    "Story_EN": "The Poet Lover",
    "Story_Brief_EN": "A poet wrote a love song that moved a maiden. They eloped and became a legendary couple.",
    "Items_EN": "Relationships: Favorable; Wealth: Promising; Career: Smooth"
  },
  {
    "number": 46,
    "Level": "中平",
    "Content": "君是山中万户侯，信知骑马胜骑牛，今朝马上看山色，争似骑牛得自由。",
    "Detail1": "此签宜守旧安享。自有山林之乐。不可贪求意外。如其不然。或嫌迟求速。或厌旧而喜新。或舍近而图远。或弃小而谋大。如骑牛者改换骑马。及至骑马。又想骑牛。懊恨踌躇。势难中止。事贻伊戚耳。少年未经阅历之人。每每似此。切宜戒之。",
    "Detail2": "明知骑牛才安全，但又贪图骑马的快感，当你选择了骑马时，就等于舍安稳求快速，但也必须经历快速所带来的危险，然而骑在马上的惊惶，又让你想要骑牛，但这时已来不及了，你只能心想着安危，无法顾及山上的风景，此签告诉我们，凡事要谨慎而行，不可想到什么做什么，还是要全面考虑。",
    "Story": "楚霸王自刎",
    "Story_Brief": "项羽兵败垓下,自刎乌江,英雄末路。",
    "Items": "事业:败;求财:无;婚姻:凶",
    "Level_EN": "Neutral Path",
    "Content_EN": "You are lord of ten thousand households, Riding a horse beats riding an ox, But watching mountains from horseback, Can't match the freedom of riding an ox.",
    "Detail2_EN": "You know riding an ox is safer, but you're tempted by the speed of a horse. Choosing the horse means trading safety for speed, and you must face the dangers that come with speed. The fear on horseback makes you want to ride the ox again, but it's too late. You've made your choice and must face the consequences. This sign warns: think carefully before choosing—safety or speed, you can't have both.",
    "Story_EN": "The Fallen Hero",
    "Story_Brief_EN": "A warrior-king was defeated, chose death over surrender, ending a heroic life.",
    "Items_EN": "Career: Failure; Wealth: Limited; Relationships: Challenging"
  },
  {
    "number": 47,
    "Level": "中平",
    "Content": "与君万语复千言，祗欲平和雪尔冤，讼则终凶君记取，试于清夜把心扪。",
    "Detail1": "此签。凡事心气和平。听人劝阻。错误早悔。反自问己。毋使刚愎自用。怙过不悛。致成凶咎。讼事尤戒。虽有怕生冤抑。只宜平情解散则吉。",
    "Detail2": "一而再，再而三地交待，以和平的方式处理，不可因为自认有理，就对簿公堂，只要以诉讼的方式处理，则必招来厄运，不可能有对自己有利的结果。不如自己平心静气下反问，也许会觉得有失公道，但不是自己认为的就是对的，只要早日打消诉讼的念头，则早日去除厄运。不可急进，只宜退守，则不会有难。",
    "Story": "梁鸿举案",
    "Story_Brief": "梁鸿与孟光举案齐眉,夫妻相敬如宾,传为佳话。",
    "Items": "婚姻:和;求财:有;事业:顺利",
    "Level_EN": "Neutral Path",
    "Content_EN": "I've told you a thousand times, Just want peace to clear your wrongs, Lawsuits always end badly, Remember this in quiet nights.",
    "Detail2_EN": "I've told you again and again—handle this peacefully. Don't think you're right and take it to court. If you handle it through lawsuits, you'll invite misfortune with no favorable outcome. Instead, calm down and reflect—maybe you're not entirely right. Settle peacefully, and you'll avoid disaster. This sign strongly warns: avoid lawsuits at all costs.",
    "Story_EN": "The Devoted Husband",
    "Story_Brief_EN": "A husband and wife treated each other with such respect that they became a model for all couples.",
    "Items_EN": "Relationships: Harmonious; Wealth: Promising; Career: Smooth"
  },
  {
    "number": 48,
    "Level": "中吉",
    "Content": "登山涉水正天寒，兄弟姻亲那得安，不遇虎头人一唤，全家谁保汝重欢。",
    "Detail1": "此签景况艰难。人口欠安。凡事类多龃龉。幸转眼之际。恰有一贵人从中得力。诚以指示迷途。须识机缘所在。悉心听从。自得骨肉团圆。人情和合。凡谋遂意矣。否则伥伥然之。岂有安全。保聚之乐乎。",
    "Detail2": "目前正处于混乱险阻的状况，全家大小兄弟姻亲间全都不和，闹得全部鸡犬不宁。虎头人，表示姓卢或虞等有如虎头字的人或属虎的人，经过此贵人的指点，将破除兄弟内外之间的不睦，重修旧好，家运将转危为安。但是当遇到虎头姓的贵人而不自知时，可能会失去这个大好机会，不得不注意，千万别失去这个可让家运好转的良机。",
    "Story": "赵子龙救主",
    "Story_Brief": "赵云单骑救主,七进七出,救出阿斗。",
    "Items": "事业:得助;求财:有;功名:显",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Climbing mountains, crossing rivers in cold, Brothers and family find no peace, Until a tiger-head person calls, Who will restore your family's joy?",
    "Detail2_EN": "You're in chaos and danger now. The whole family—brothers, relatives—are all in conflict, causing complete turmoil. A 'tiger-head person' means someone with the character for 'tiger' in their name (like Lu or Yu) or someone born in the tiger year. With this noble person's guidance, conflicts between brothers and family will be resolved, and family harmony will be restored. This sign shows help is coming—wait for the right person.",
    "Story_EN": "The Protector",
    "Story_Brief_EN": "A warrior single-handedly rescued his lord, charging in and out seven times, saving the child.",
    "Items_EN": "Career: Get Help; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 49,
    "Level": "下下",
    "Content": "彼此居家只一山，如何似隔鬼门关，日月如梭人易老，许多劳碌不如闲。",
    "Detail1": "此签主情意隔角。不遇扶持。看似密迩相连。其实咫尺天涯。势同秦越。智士知己知彼。舍此另投。或有遇合。若信。文貌周旋。口头热闹。外密中疏。终鲜实际。不唯耽误时日。更费趋候奔走之劳。此等人为世诟病久矣。奈何其弗之省也。",
    "Detail2": "虽然与周围的人看似亲近，但却从未真心地相待过，犹如阴阳两界，是无法跨越的。在快速的时间飞逝下，人也渐渐地不再年轻，但总是所托非人，无法成事，白忙一场，倒不如什么都不做，生活过得倒还比较自在。此签表示无法和他人情意交流，无法相信别人，只相信自己，但又交待错人，一生都是如此，所以别再相信不该相信的人了。",
    "Story": "张飞断桥",
    "Story_Brief": "张飞在长坂桥断桥阻敌,一声怒吼吓退曹军。",
    "Items": "事业:勇进;求财:有;功名:显",
    "Level_EN": "Challenging Phase",
    "Content_EN": "We live on the same mountain, Yet it's like the gate of hell between us, Time flies, people grow old, All this toil, better to rest.",
    "Detail2_EN": "Though you seem close to those around you, you've never treated them sincerely. It's like two different worlds that can't cross over. As time flies, people age, but you always trust the wrong people and accomplish nothing. You're just busy for nothing. Better to do nothing than waste effort. This sign shows isolation despite proximity—true connection is missing.",
    "Story_EN": "The Warrior",
    "Story_Brief_EN": "A warrior broke a bridge and roared, scaring away an entire enemy army.",
    "Items_EN": "Career: Bold Advance; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 50,
    "Level": "上吉",
    "Content": "人说今年胜去年，也须步步要周旋，一家和气多生福，萋菲谗言莫听偏。",
    "Detail1": "此签主年运亨通。时和岁稔。家旺人兴。然修身乃齐家之本。礼教实门内之防。必须周规折矩。仁让雍雍。方遂和平之福。更忌妇人搬弄。宵小离间。是为萋菲谗言。不可偏听。斯家道成而流泽长矣。凡事谨慎和平则吉。",
    "Detail2": "今年明显地比去年要好，运势也渐渐顺遂，只要亦步亦趋地循规蹈矩，全家和乐融融，则会有更多的福气，要小心女人间的是非，言语离间是破坏的导火线，不必过于听信，得来不易的好运不可因此而破运。此签表示要从人和做起，等到适和的天时，则会旺家旺族，不可等到时机已到，才要调整人事，则会浪费天助好运。",
    "Story": "苏东坡游赤壁",
    "Story_Brief": "苏东坡游赤壁,写下《赤壁赋》,成为千古名篇。",
    "Items": "功名:成;求财:有;事业:顺利",
    "Level_EN": "High Resonance",
    "Content_EN": "People say this year beats last, But you must step carefully, Family harmony brings more blessings, Don't listen to slanderous words.",
    "Detail2_EN": "This year is clearly better than last, and fortune is gradually improving. Just follow step by step, stay within bounds, and keep the family harmonious. More blessings will come. Be careful of gossip among women—words that divide are the spark of destruction. Don't listen too much. Hard-won harmony is precious—protect it. This sign shows improvement, but warns: guard against discord.",
    "Story_EN": "The Poet",
    "Story_Brief_EN": "A poet visited a famous battlefield, wrote a masterpiece, and created an immortal work of literature.",
    "Items_EN": "Achievement: Favorable; Wealth: Promising; Career: Smooth"
  },
  {
    "number": 51,
    "Level": "上吉",
    "Content": "君今百事且随缘，水到渠成听自然，莫叹年来不如意，喜逢新运称心田。",
    "Detail1": "此签暂时安分。后此渐有机缘。不求自至。切勿因近年谋为不遂。常自嗟叹。人事有得有失。命运有否有泰。一到亨通之时。名成利就。自有吐气扬眉之日也。",
    "Detail2": "过去也许有点受阻的感觉，但凡事只宜随遇而安，不可过度强求，运势走到此时，有水到渠成之势，只要顺其自然，一切将会相随心转。不要怪罪过去的不顺遂，如果只会怨天尤人，就算好运来临也只是擦肩而过，以欢欣的心情迎接好运势的到来，一切将会更称心如意。此签表示一时的受阻，不必太在意，即将来临的好运才是值得珍惜的。",
    "Story": "王猛扪虱",
    "Story_Brief": "王猛扪虱谈天下,被苻坚重用,助前秦统一北方。",
    "Items": "事业:得贤;求财:有;功名:显",
    "Level_EN": "High Resonance",
    "Content_EN": "Let all things follow their course, Water finds its channel naturally, Don't lament past disappointments, New fortune brings joy to your heart.",
    "Detail2_EN": "The past may have felt blocked, but everything should follow its natural course. Don't force things. Fortune has reached a point where water naturally finds its channel. Just go with the flow, and everything will turn as your heart desires. Don't blame past misfortunes. If you only complain, you'll miss the new fortune coming. This sign shows: let go, and good fortune will flow naturally.",
    "Story_EN": "The Strategist",
    "Story_Brief_EN": "A strategist discussed the world while picking lice, was trusted by a ruler, and helped unify the north.",
    "Items_EN": "Career: Get Talent; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 52,
    "Level": "上吉",
    "Content": "兀坐幽居叹寂寥，孤灯掩映度清宵，黄金忽报秋光好，活计扁舟渡北朝。",
    "Detail1": "此签现在光景落寞不堪。几无复有起色。岂知通塞无常。剥复递转。不意之间。顿有好音。自北而至。或已向北而往。名利即在此中。滔滔顺利。凡事有意外遇合。",
    "Detail2": "目前处于时运不济之时，度过无数个孤独寂寥的日子，意味沉寂地等待，终于等到好运的到来，大约会在秋季，而且是忽然间就会有好运来，将原来停滞不前的运势，一下子就打通了，而且轻松容易地过生活，完全没有生计上的问题，好运或许来自北方，或是必须往北方去，一切在命运中，自会有安排，目前的困顿将是未来顺意的基石。",
    "Story": "邓禹投刘秀",
    "Story_Brief": "邓禹投靠刘秀,成为云台二十八将之首。",
    "Items": "事业:得主;求财:有;功名:显",
    "Level_EN": "High Resonance",
    "Content_EN": "Sitting alone in quiet solitude, Lonely lamp lights the long night, Suddenly gold news comes in autumn, Your path: a small boat to the north.",
    "Detail2_EN": "You're in a time of poor fortune, spending countless lonely, desolate days. You've been waiting in silence, and finally good fortune is coming—around autumn, and it will come suddenly. The stagnant fortune will suddenly open up, and you'll move forward smoothly. This sign shows: after long waiting, sudden breakthrough. Be patient—autumn brings the change.",
    "Story_EN": "The Follower",
    "Story_Brief_EN": "A general joined a rising leader, became the first of twenty-eight generals, and helped establish a dynasty.",
    "Items_EN": "Career: Meeting a Benefactor; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 53,
    "Level": "下下",
    "Content": "艰难险阻路蹊跷，南鸟孤飞依北巢，今日贵人曾识面，相逢却在夏秋交。",
    "Detail1": "此签历涉艰险。谋为不遂。不知避凶趋吉。反自舍安就危。与南鸟北巢何异。须待贵人得力。幸今日已经识面。将来夏秋之交。必有应验。名利可成。婚姻可合。孕育可许。凡事先有机兆。而后成之。",
    "Detail2": "总是比别人多花许多的力气，还是倍受阻难，而且颠沛流离，重重难关，似乎永无天日，运势无法顺遂，就如南方的飞鸟独自朝着北方而去，等着它的是冰天雪地，并非春暖花开的天堂，也可说是去错地方了。如此的阻运必须有贵人相助，才能有所改变，你的贵人是你已认识的人，但是必须在夏秋之交再度重逢，你才能因贵人的指点而改变运势。要注意贵人的出现，不要错失转运的好机会。",
    "Story": "刘备三让徐州",
    "Story_Brief": "刘备三让徐州,显示仁义,但最终失去徐州。",
    "Items": "事业:先得后失;求财:无;婚姻:不利",
    "Level_EN": "Challenging Phase",
    "Content_EN": "Difficult roads, strange paths, Southern bird flies alone to northern nest, Today you meet a known noble, The meeting comes in summer and autumn.",
    "Detail2_EN": "You always work harder than others but face many obstacles. You're adrift, facing endless difficulties with no end in sight. Fortune won't go smoothly. Like a southern bird flying alone north, it faces ice and snow, not warm spring. But today you'll meet a noble person you once knew. This meeting will come in summer or autumn, bringing the help you need. This sign shows: help is coming from an unexpected source.",
    "Story_EN": "The Humble Ruler",
    "Story_Brief_EN": "A ruler declined a territory three times to show righteousness, but eventually lost it anyway.",
    "Items_EN": "Career: Gains Followed by Losses; Wealth: Limited; Relationships: Unfavorable"
  },
  {
    "number": 54,
    "Level": "中平",
    "Content": "万人丛里逞英豪，便欲飞腾霄汉高，争奈承流风未便，青灯黄卷且勤劳。",
    "Detail1": "此签主功名沉滞。时运未济。虽然自逞英豪。志图冲举。然如舟楫未及洪流。鸿毛不遇顺风。仍须守待。唯用功于青灯黄卷之中。皇天不负苦心人。将来自有发迹。慎毋欲速。毋怠惰。功夫既到。天机自合耳。凡事以艰难得之。",
    "Detail2": "想要超出众人之上，而且自负有超脱的能耐，只可惜天地万物有序，并非有崇高的理想，就一定能达成，必须等待时机的到来，现在是时运不济之时，就如船遇浅滩、羽翼无法顺风，无法依自己的意愿而行，必须努力度过这暗潮汹涌的困境，等待好运势的到来。目前必须努力在读书或自修上，人在困惑之时，可从书本中找到答案，而且不可有懈怠之心，必须勤劳努力，等待好运。",
    "Story": "苏秦六国封相",
    "Story_Brief": "苏秦游说六国,合纵抗秦,身佩六国相印。",
    "Items": "事业:大吉;求财:大利;功名:显",
    "Level_EN": "Neutral Path",
    "Content_EN": "Stand out among ten thousand, Want to soar to the heavens, But the wind isn't right, Study by lamplight, work hard.",
    "Detail2_EN": "You want to rise above the crowd and believe you have extraordinary ability. But the universe has its order—lofty ideals alone won't guarantee success. You must wait for the right time. Now fortune isn't favorable—like a boat in shallow water or wings without wind, you can't advance. Study hard, work diligently, and wait. When the time comes, you'll soar. This sign shows: prepare now, success comes later.",
    "Story_EN": "The Diplomat",
    "Story_Brief_EN": "A diplomat persuaded six states to unite, wore six prime minister seals, and gained great fame.",
    "Items_EN": "Career: Very Favorable; Wealth: Great Profit; Achievement: Prominent"
  },
  {
    "number": 55,
    "Level": "中平",
    "Content": "耕勤力作莫蹉跎，衣食随时安分过，纵使经商收倍利，不如逐岁廪米多。",
    "Detail1": "此签戒营谋务本。衣食随缘。不可贪求。不可过分。若务商贾奇嬴之利。必至使用心机。惯行刻剥。财利终不永久。何如耕作勤俭之人。自食其力。仓廪充实。岂非裕后传家之长计乎。凡事宜守旧。仕人不可改商。定主亏折。若由商改士则吉。庠序食廪米。仕宦食廪禄。",
    "Detail2": "努力耕作不懈怠，则会衣食无缺地过着好日子，所谓的耕作是指实际操作的工作，并非是从事商业，此签告戒不宜从商，虽然从事商业有更大的收获，但利益大的事情风险也很大，眼前的利润有背后的风险，可能会有更大的损失，无法有稳定的收入，倒不如从事公务员，可以有稳定的收入，长时间的累积，也比从商要好很多。此签建议，如果目前从商，必须改行从事稳定收入的公职较好。",
    "Story": "周亚夫细柳营",
    "Story_Brief": "周亚夫治军严明,细柳营中,连汉文帝也要遵守军令。",
    "Items": "事业:严明;求财:有;功名:显",
    "Level_EN": "Neutral Path",
    "Content_EN": "Work the fields diligently, don't waste time, Food and clothing come with the seasons, Even if business brings double profit, Better steady grain year by year.",
    "Detail2_EN": "Work hard without slacking, and you'll have food and clothing for a good life. 'Working the fields' means practical, hands-on work, not business. This sign warns against commerce. Though business may bring greater profit, high profit means high risk. What you see isn't always what you get. Steady, honest work is safer and more reliable. This sign favors stability over speculation.",
    "Story_EN": "The Disciplinarian",
    "Story_Brief_EN": "A general maintained strict military discipline. Even the emperor had to follow military rules in his camp.",
    "Items_EN": "Career: Discipline; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 56,
    "Level": "下下",
    "Content": "心头理曲强词遮，直欲欺官行路斜，一旦丑形临月镜，身投宪网莫咨嗟。",
    "Detail1": "此签主有瞒心昧己之事。官非口舌之灾。始时诪张为幻。希图幸胜。一旦水落石出。机关破露。致遭刑宪之累。自作自受。理所应得。复自嗟叹何益乎。凡有机事机心。及早悔悟免祸。",
    "Detail2": "虽然心里知道理由不够充份，但仍然以花言巧语在遮饰，此种个性易惹官非，就算在公堂之上，照样自圆其说，欺官骗上，并非自认有理就会赢，毕竟夜路走多了，还是会露出马脚，可以骗别人，但无法骗自己，一旦事迹败露之后，所有罪刑都原形毕露，总会受到法律的制裁，到时不必怨叹。如果能从现在起有所改变，以真心相待，相信必可免除一场牢狱之灾。",
    "Story": "王昭君和亲",
    "Story_Brief": "王昭君远嫁匈奴,促进汉匈和好,但个人命运多舛。",
    "Items": "婚姻:和亲;求财:无;事业:有功",
    "Level_EN": "Challenging Phase",
    "Content_EN": "Weak arguments, strong words to cover, Trying to deceive, walking crooked, Once the mirror shows your true form, Caught in the law, don't complain.",
    "Detail2_EN": "You know your reasons are weak, but you still use flowery words to cover up. This personality easily invites legal trouble. Even in court, you'll try to justify yourself, deceiving officials. Thinking you're right doesn't mean you'll win. Walk the night path too often, and you'll be exposed. Once your true form appears in the mirror of justice, you'll be caught in the law. This sign strongly warns: honesty is the only policy.",
    "Story_EN": "The Peacemaker",
    "Story_Brief_EN": "A beautiful woman was sent far away in marriage to promote peace, but her personal fate was tragic.",
    "Items_EN": "Relationships: Harmonious; Wealth: Limited; Career: Success"
  },
  {
    "number": 57,
    "Level": "中平",
    "Content": "事端百出虑虽长，莫听人言自主张，一着仙机君记取，纷纷闹里更思量。",
    "Detail1": "此签凡有疑难。须自作主。不可靠人。如奕棋者。本有仙着可下。人自不识。急须参透此事要着。恰中窍会。自然不劳而理。不战而定。若但随人作计。是非不辨。进退不决。岂有济乎。",
    "Detail2": "事情层出不穷，变化多端，虽然自己有许多的想法，但总是下不了决定，此时千万不要听从别人的建议，必须自有主张，就如下棋的人，遇到了难解之时，还是必须自己思量，而且会有神来一笔之助，目前虽然闹得沸沸扬扬，必须改变犹豫不决的个性，自己下决定必能度过此时的喧闹，此签告诫千万不可由他人来帮你决定，因为必定是个坏结果，相信自己就对了。",
    "Story": "韩信点兵",
    "Story_Brief": "韩信善于用兵,多多益善,成为一代名将。",
    "Items": "事业:大吉;求财:有;功名:显",
    "Level_EN": "Neutral Path",
    "Content_EN": "Endless troubles, though you think long, Don't listen to others, decide yourself, Remember this divine move, Think carefully in the chaos.",
    "Detail2_EN": "Troubles keep coming, situations keep changing. Though you have many ideas, you can't make a decision. Don't listen to others' advice now—you must decide for yourself. Like a chess player facing a difficult position, you must think for yourself. You'll find the divine move—the perfect solution. This sign shows: trust your own judgment in chaos. The answer is within you.",
    "Story_EN": "The Commander",
    "Story_Brief_EN": "A commander excelled at using troops—the more, the better. He became a legendary general.",
    "Items_EN": "Career: Very Favorable; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 58,
    "Level": "上吉",
    "Content": "苏秦三寸足平生，富贵功名在此行，更好修为阴骘事，前程万里有通亨。",
    "Detail1": "此签宜动不宜守。宜远不宜近。口舌之才。必有遇合。名利可成。但恐阴骘有亏。至令天机阻滞。必须勤加积累。上格天心。自然一举冲霄。前程远大。戒人去恶从善。趋吉避凶之意。至深切矣。",
    "Detail2": "靠着三寸不烂之舌，就可让自己衣食无缺，是个天生靠口才吃饭的人，而且此次的行动，更可让你功成名就，享有富贵荣华，可说达到人生的高点。然而想让自己富贵长在，必须要多积阴德，多做善事，未来的前程将可更长远，并且不受阻碍。如果无视积德之事，就算是好运来临，也只是一时，必会招来厄运，而且不做善事的人，抽到此签也等于是没有，不受好运保佑。",
    "Story": "苏武持节",
    "Story_Brief": "苏武持节不屈,在匈奴十九年,终得归汉。",
    "Items": "事业:坚持;求财:无;婚姻:待时",
    "Level_EN": "High Resonance",
    "Content_EN": "Three inches of tongue serve you well, Fame and fortune in this journey, Better to do good deeds in secret, Your path ahead stretches ten thousand miles.",
    "Detail2_EN": "With your silver tongue, you can make a living. You're born to live by your words, and this journey will bring you fame and fortune, reaching the peak of life. But to keep this fortune long, you must do more good deeds in secret, accumulate virtue, and your path ahead will stretch ten thousand miles, smooth and open. This sign shows: your talent brings success, but virtue sustains it.",
    "Story_EN": "The Steadfast",
    "Story_Brief_EN": "An envoy remained loyal for nineteen years in captivity, holding his staff, and finally returned home.",
    "Items_EN": "Career: Perseverance; Wealth: Limited; Relationships: Await Timing"
  },
  {
    "number": 59,
    "Level": "中平",
    "Content": "门衰户冷苦伶仃，可叹祈求不一灵，幸有祖宗阴骘在，香烟未断续螟蛉。",
    "Detail1": "此签门祚衰微。子嗣艰贵。屡次求神不应。当由己身德薄。未能感格天心。然赖先世以来。余泽未斩。己虽无出。尚可谋立继嗣。上承烟祀。犹为不幸中之幸。凡事不得乎上。可望其次。不得于彼。必得于此。总须善功培植方应。",
    "Detail2": "家道逐渐衰弱，人丁单薄，门户冷清，对于祈祷之事，没有任何一件实现，只会祈求，却不懂得付出是此签的重点，所以一直无法如愿。所幸祖先有积阴德，庇荫到此代，才不至于因此而断了香火。此签指出，由于人丁过于稀少，无法有自己的子嗣，但会有继子继承衣钵，以解决无后的问题。如果能多加积德，则能更加顺遂。",
    "Story": "张良拾履",
    "Story_Brief": "张良为黄石公拾履,通过考验,获得太公兵法。",
    "Items": "功名:成;求财:有;事业:得助",
    "Level_EN": "Neutral Path",
    "Content_EN": "Family declines, household cold and lonely, Prayers bring no response, Fortunately ancestors left virtue, The incense continues, adopted son inherits.",
    "Detail2_EN": "Your family is gradually declining, few people, cold and quiet. None of your prayers have been answered. You only pray but don't know how to give—this is the key point of this sign. You've been unable to get what you want. Fortunately, your ancestors accumulated virtue, blessing you to this generation, so the family line doesn't end completely. This sign shows: inherited blessings sustain you, but you must also give.",
    "Story_EN": "The Student",
    "Story_Brief_EN": "A young man picked up shoes for an old master, passed the test, and received the art of strategy.",
    "Items_EN": "Achievement: Favorable; Wealth: Promising; Career: Get Help"
  },
  {
    "number": 60,
    "Level": "上上",
    "Content": "羡君兄弟好名声，一意谦撝莫自矜，丹诏槐黄消息近，巍巍科甲两同登。",
    "Detail1": "此签才品超群。同气和美。但须小心畏慎。不可骄傲取咎。转瞬之间。即有丹诏之荣。槐黄之喜。好音为不远矣。又主兄弟同榜之兆。凡事应在双数。",
    "Detail2": "兄弟指的是师出同门之谊，不必羡慕兄弟的好名声，因为自己也不差，一切都算顺利，但要记住不可炫耀，也不可仗势或自大，可得到上天的帮助而一举成名天下知，而且会与同门师兄弟一同上榜，或同时被提拔重用，必须随时保持谦卑的态度，不可因得势而沾沾自喜，如能时时谦为，排除忌妒之心，则好运会一直常存。此签表示出好事成双，不要排斥或忌妒同门，则能共享荣誉。",
    "Story": "诸葛亮出山",
    "Story_Brief": "诸葛亮出山辅佐刘备,三分天下,成为一代名相。",
    "Items": "事业:大吉;求财:有;功名:显",
    "Level_EN": "Supreme Harmony",
    "Content_EN": "Envy your brothers' good name, Stay humble, don't be proud, Imperial edict and yellow notice near, Both of you will pass the exam.",
    "Detail2_EN": "'Brothers' means those who studied together. Don't envy their good reputation—you're not bad either. Everything is going smoothly, but remember: don't show off, don't rely on power or be arrogant. You'll get heaven's help and become famous. You and your fellow students will succeed together, both passing the imperial exam. This sign shows: success through humility and shared achievement.",
    "Story_EN": "The Sage",
    "Story_Brief_EN": "A sage came down from the mountain, helped a ruler, divided the world into three, and became a legendary prime minister.",
    "Items_EN": "Career: Very Favorable; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 61,
    "Level": "中吉",
    "Content": "啸聚山林凶恶俦，善良无事苦煎忧，主人大笑出门去，不用干戈盗贼休。",
    "Detail1": "此签主道途惊险。小人侵害。唯是善良之人。遇凶不凶。遇险不险。则意外忧惧。弹琴可以解围。焚香可以却敌。彼自谈笑。贼已遁逃。非所谓吉人天相者乎。凡事凶中得吉。阴蒙神佑。当益勉之。",
    "Detail2": "小人当道，此行必充满险阻，并有盗贼肆虐之象，然而只要是为人正直，且循规蹈矩之人，必能顺利脱险，只是倍受煎熬，无形之中得到神明的庇荫。不妨随自己意愿，来去自如，坦然行事，完全不受影响，只要自己行得正，即使不用干戈，宵小盗贼也自会散去。此签指出遇到凶险之事，会自动化解，若以小人之心以对，反会招厄，必须培养光明正大的心胸。",
    "Story": "苏秦刺股",
    "Story_Brief": "苏秦发奋读书,以锥刺股,终成纵横家。",
    "Items": "功名:成;求财:有;事业:成功",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Evil gangs gather in the mountains, Good people suffer without cause, The master laughs and walks away, No need for weapons, thieves retreat.",
    "Detail2_EN": "Villains are in power, this journey will be full of danger with bandits running wild. But if you're upright and follow the rules, you'll escape safely, though you'll suffer greatly. You'll receive invisible divine protection. Feel free to come and go as you wish, be open and honest, and you'll be safe. This sign shows: virtue protects you even in danger.",
    "Story_EN": "The Diligent",
    "Story_Brief_EN": "A scholar studied hard, pricking his thigh with an awl to stay awake, and eventually became a master strategist.",
    "Items_EN": "Achievement: Favorable; Wealth: Promising; Career: Success"
  },
  {
    "number": 62,
    "Level": "中吉",
    "Content": "百千人面虎狼心，赖汝干戈用力深，得胜回时秋渐老，虎头城里喜相寻。",
    "Detail1": "此签主克敌战胜之兆。言虎狼之人。百千为群。势甚猖獗。赖汝整顿干戈。歼擒不遗余力。是以振旅凯还。正在秋色将老之际。一时功成名遂。恰于虎头城里。喜气相逢。追寻快意。其亦有行藏自适者乎。凡事先险阻。后亨通。应在秋日。或西方或虎字头州县地名。或应在晚景。",
    "Detail2": "百千人则意味相当多的人，虎狼心是指作恶多端邪恶之人，必须依赖你大动干戈，才得以铲除，经过一番惨烈征战，胜利之时，已经到了老年，有道是好景不常在，当得到名声之时，已经逐渐老了，在有虎字头的地方可以安乐享受老年。此签表示经过激烈的征战，最后克敌致胜，颐养天年，晚年安逸。",
    "Story": "韩信拜将",
    "Story_Brief": "韩信被刘邦拜为大将,助其建立汉朝。",
    "Items": "事业:大吉;求财:有;功名:显",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "A thousand people with wolf hearts, You must use force deeply, Victory comes when autumn ages, In Tiger City, joy awaits.",
    "Detail2_EN": "'A thousand people' means many people. 'Wolf hearts' means evil, wicked people. You must use great force to eliminate them. After fierce battle, when victory comes, you'll be old. Good times don't last forever. When you gain fame, you'll also find joy in Tiger City. This sign shows: great effort brings victory, but timing matters. Success comes, but later in life.",
    "Story_EN": "The General",
    "Story_Brief_EN": "A general was appointed by a ruler, helped establish a great dynasty, and became a legendary commander.",
    "Items_EN": "Career: Very Favorable; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 63,
    "Level": "中吉",
    "Content": "曩时征北且图南，筋力虽衰尚一堪，欲识生前君大数，前三三与后三三。",
    "Detail1": "此签前途亨通。中间不免折挫。现在虽极疲困。然有一番光景在后。不可堕志。亦是大数注定。必其人平日居心及行事。克邀天鉴。故能不终没没也。三三。乃大数应验处。凡事失中有得。难中有易。晚景荣华。",
    "Detail2": "过去南征北讨，无不如意顺遂，虽然耗费许多筋力，而且偶有失败，此时虽然有所阻滞，但终能由败转胜，还是可以得到胜利，这一切都是天理注定。此签有数字的表示前三三与后三三，表示三、六、九等数时，有所指示，但依所问之事，而有不同的解释，不可断章取义，多参考其他因素。",
    "Story": "杨震拒金",
    "Story_Brief": "杨震拒收贿赂,以'天知地知你知我知'闻名。",
    "Items": "事业:清廉;求财:正;婚姻:和",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Once campaigned north and south, Strength may fade, but still capable, To know your life's great number, Three times three before, three times three after.",
    "Detail2_EN": "In the past, you campaigned north and south, all went smoothly. Though it cost much strength and you occasionally failed, now though there are obstacles, you can turn defeat into victory and still win. This is all predestined by heaven. This sign shows numbers: three times three before and three times three after—meaning your fortune has cycles. This is your destined pattern.",
    "Story_EN": "The Honest",
    "Story_Brief_EN": "A scholar refused a bribe, saying 'Heaven knows, earth knows, you know, I know,' and became famous for integrity.",
    "Items_EN": "Career: Integrity; Wealth: Righteous Wealth; Relationships: Harmonious"
  },
  {
    "number": 64,
    "Level": "上上",
    "Content": "吉人相遇本和同，况有持谋天水翁，人力不劳公论协，事成功倍笑谈中。",
    "Detail1": "此签谋为和合。得遇贵人提携。凡事称意。不劳而成。必其人素为人所敬信。其事又为众所欣悦。是又恰遇机缘。一倡百和。谈笑中。事立而成功。岂非天人相应。相时而动者乎。",
    "Detail2": "所谓吉人自有天相，吉人处事本来就称心如意，而且得天独厚，能得到贵人相助，自己并不须花费多少力气，贵人为天水翁，指贵人应在有天或水字的地名。不须花费心力，则能得到大众的认同且契合人心，得到事半功倍之效，而且在谈笑之中就得到成功，可说是天时、地利、人和之作，这是个必定会成功的佳运。",
    "Story": "管仲射钩",
    "Story_Brief": "管仲曾射中齐桓公的带钩,但桓公不计前嫌,重用管仲。",
    "Items": "事业:得贤;求财:有;功名:显",
    "Level_EN": "Supreme Harmony",
    "Content_EN": "Good people meet in harmony, Especially with the wise old man, No need for great effort, Success comes with double results, all in laughter.",
    "Detail2_EN": "As they say, good people have heaven's help. Good people naturally succeed and are blessed. You'll get help from a noble person without much effort. The noble person is the 'wise old man'—help will come from a place with 'heaven' or 'water' in its name. Without much effort, you'll achieve great success, and everything will be resolved in laughter. This sign shows: natural success with help.",
    "Story_EN": "The Forgiven",
    "Story_Brief_EN": "A minister once shot an arrow that hit a ruler's belt hook, but the ruler forgave him and trusted him greatly.",
    "Items_EN": "Career: Get Talent; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 65,
    "Level": "上上",
    "Content": "朔风凛凛正穷冬，渐觉门庭喜气浓，更入新春人事后，衷言方得信先容。",
    "Detail1": "此签沉滞既久。困而将亨之象。譬寒冬凛冽之际。剥极阳生。渐得交泰更新。万物从此发生。正多美景。占此者冬季有喜。交春人事遂意。另有一番好消息。指日俟之。",
    "Detail2": "停滞不前的运势，开始运作了，犹如凛冽的寒冬将尽，接着而来的就是春暖花开的春天，而且逐渐感受到喜气洋洋，尤其是进入到新春之后，心里的愿望似乎得到了回应，出现了助你实现愿望的贵人，将得到完美的成功。此签指沉滞的运气完全开通了，而且心想事成，就是会出现贵人来帮你实现想法，必须把握良机，尤其是冬春交际，是转运之时。",
    "Story": "蒙恬筑长城",
    "Story_Brief": "蒙恬率军修筑长城,防御匈奴,功勋卓著。",
    "Items": "事业:有功;求财:有;功名:显",
    "Level_EN": "Supreme Harmony",
    "Content_EN": "Cold north wind in deep winter, Gradually joy fills the door, When spring arrives with new life, Sincere words will be believed.",
    "Detail2_EN": "Stagnant fortune is starting to move. Like the harsh winter ending, spring with blooming flowers is coming. You'll gradually feel joy, especially after entering the new spring. Your heart's wishes seem answered, and helpers appear. This sign shows: after long stagnation, sudden movement. Spring brings new life and opportunities.",
    "Story_EN": "The Builder",
    "Story_Brief_EN": "A general led troops to build the Great Wall, defended against northern tribes, and achieved great merit.",
    "Items_EN": "Career: Distinguished Achievement; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 66,
    "Level": "上上",
    "Content": "耕耘只可在乡邦，何用求谋向外方，只见今年新运好，门阑喜气事双双。",
    "Detail1": "此签不宜远行。只宜守旧。乡邦之地。自有荣华。耕耘之中。亦有发迹。况值运限更新。门庭以内。喜事重重。自可享受优游。倘舍现前实地。希冀远大不可知之数。将贻后悔。居易俟命者得之。",
    "Detail2": "若要努力奋发，只需在家乡，根本不必向外谋求机会，只要守住原来的家业，则会有很好的发展。尤其是今年遇到了大发的好流年，家中会喜气洋洋，而且接二连三，不只一件。此签表示今年的流年大吉大利，家中喜事连连，好运不断，如果坚持出外打拼，则不适用此运，后果将不可想象，无法像留在家乡中这般如意，必须深思。",
    "Story": "张骞凿空",
    "Story_Brief": "张骞出使西域,开辟丝绸之路,被称为'凿空'。",
    "Items": "事业:远行;求财:有;功名:显",
    "Level_EN": "Supreme Harmony",
    "Content_EN": "Work the fields only in your homeland, No need to seek opportunities abroad, This year brings new good fortune, Double joy at your door.",
    "Detail2_EN": "If you want to work hard, stay in your hometown. There's no need to seek opportunities elsewhere. Just maintain your original family business, and you'll have great development. Especially this year, you've met a great fortune year. Your home will be filled with joy, one thing after another, not just one. This sign shows: stay local, fortune comes home.",
    "Story_EN": "The Explorer",
    "Story_Brief_EN": "An envoy journeyed to the western regions, opened the Silk Road, and was called 'the opener of paths.'",
    "Items_EN": "Career: Travel; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 67,
    "Level": "中平",
    "Content": "才发君心天已知，何须问我决狐疑，愿子改图从孝悌，不愁家室不相宜。",
    "Detail1": "此签好善有好报。作恶有恶报。示人早知警悟。现在所谋不善。天神早已洞照。自是必不可行。何须启问。唯有改悔前过。力从孝悌上起见。自有家室和平之乐。趋吉避凶。唯人自择。可不悟乎。",
    "Detail2": "在发心动念之时，老天就都已知道了，既然是不好的坏心眼，又何必再问神佛解决心中的疑虑，其实自己的内心相当清楚，什么是对什么是错，只要改过向善，将心中的坏念头一并清除，希望能从孝悌开始做起，孝顺父母、友爱手足，是最基本的孝悌之道，只要做到孝悌，则不必担忧家中无法和乐，自然而然地家业平安快乐，有道是家和万事兴。如果不改除心中的坏念头，厄运则随时而至。",
    "Story": "金日磾归汉",
    "Story_Brief": "金日磾从匈奴归汉,成为汉武帝的忠臣。",
    "Items": "事业:得主;求财:有;功名:显",
    "Level_EN": "Neutral Path",
    "Content_EN": "Heaven knows when you first think, Why ask me to resolve doubts? I hope you change to filial piety, Then family harmony will come.",
    "Detail2_EN": "When you first have a thought, heaven already knows. Since it's a bad thought, why ask the gods to resolve your doubts? Your own heart is quite clear about right and wrong. Just change to goodness, clear all bad thoughts from your heart, and follow filial piety and brotherly love. Then your family will be harmonious. This sign shows: change your heart, change your fortune.",
    "Story_EN": "The Convert",
    "Story_Brief_EN": "A foreign general returned to serve the empire, became a loyal minister, and served faithfully.",
    "Items_EN": "Career: 得主; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 68,
    "Level": "中吉",
    "Content": "南贩珍珠北贩盐，年来几倍货财添，劝君止此求田舍，心欲多时何日厌。",
    "Detail1": "此签劝人知足不辱。知止不耻之意。凡人前事谋为。既已遂意。现在境地。亦可粗安。即当持盈戒满。自守清静。就此求田问舍。自得安常处顺之乐。若贪多不已。终无厌足。不唯自取烦劳。有不更招意外者乎。进退行止之几。当自决之。",
    "Detail2": "具有相当好的生意头脑，这几年来得到不少的利润，但也养成了不小的野心，奉劝你适可而止！不如放弃营利，就此退回田野生活，则可过着安居顺遂的生活，人的欲望是无法满足的，心愈贪，则越显得不足，永无止息之日，如此下去，则会因贪而招来厄运，不到败光家业，厄运是不会停止的。须多深思，此时是必须急流勇退的最佳时机，回归恬静的生活，才是真正的人生。",
    "Story": "郭子仪单骑退敌",
    "Story_Brief": "郭子仪单骑见回纥,以诚感化,退敌十万。",
    "Items": "事业:大吉;求财:有;功名:显",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Sell pearls in south, salt in north, Profits multiply over years, I advise you to stop and retire, When will greed ever be satisfied?",
    "Detail2_EN": "You have excellent business sense and have made good profits over the years, but this has also created great ambition. I advise you to know when to stop! Better to give up profit and return to country life—you'll live peacefully and smoothly. Human desire can never be satisfied. The more you have, the more you want. Stop while you're ahead. This sign warns: greed destroys peace.",
    "Story_EN": "The Negotiator",
    "Story_Brief_EN": "A general rode alone to meet the enemy, moved them with sincerity, and made ten thousand enemies retreat.",
    "Items_EN": "Career: Very Favorable; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 69,
    "Level": "中平",
    "Content": "舍舟遵路总相宜，慎勿嬉游逐贵儿，一夜樽前兄与弟，明朝仇敌又相随。",
    "Detail1": "此签一切所为。宜踏实地。交游间更宜慎择。谨防所与非人。侵耗陷害。口舌是非。酒色财气结仇等情。唯冀慎之于先。免致受其笼络。斯全身远害之道得矣。凡事趋吉避凶。改恶从善。不可自误。",
    "Detail2": "放弃风浪巨大的水路，改以风险较小的陆路，然而各有各的风险，并不见得陆路就会平安无事，还是必须小心为上。不可与富家子弟混在一起，因为看似显贵其实虚有其表者居多，而且较狡诈，容易受骗，只要失去了利用价值，或分赃不均，随时可以翻脸，这是小人的行为。若疏忽而与小人同谋则凶。",
    "Story": "狄仁杰荐贤",
    "Story_Brief": "狄仁杰推荐张柬之等贤臣,为唐朝中兴奠定基础。",
    "Items": "事业:得贤;求财:有;功名:显",
    "Level_EN": "Neutral Path",
    "Content_EN": "Leave the boat, take the road, all suitable, Don't play with noble children, One night drinking with brothers, Tomorrow enemies follow again.",
    "Detail2_EN": "Abandon the dangerous water route and take the safer land route. But each has its risks—the land route isn't necessarily safe. You must still be careful. Don't mix with rich children, because many who seem noble are actually empty. One night you drink with brothers, but tomorrow they become enemies again. This sign warns: choose your path and company carefully.",
    "Story_EN": "The Recommender",
    "Story_Brief_EN": "A judge recommended worthy ministers, laying the foundation for a dynasty's restoration.",
    "Items_EN": "Career: Get Talent; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 70,
    "Level": "中吉",
    "Content": "雷雨风云各有司，至诚祷告莫生疑，与君定约为霖日，正是蕴隆中伏时。",
    "Detail1": "此签言世间一切事故。冥冥中有主之者。须待时候已到。机缘自就。如祷雨者。至诚感动。亦须仰奉天命。然后风伯雨师。方得应候施行。后二句。是言雨降之期。在中伏之际。凡事皆可类推。",
    "Detail2": "大自然的天气变化，各有其道理，并非可依人为所控制，人生的吉厄顺阻，不也是如此，必须诚恳地祷告，让天神感受到你的诚意。霖日，则为下雨之日，在大暑之时表明何时会下雨，竟能准确地在中伏之时下起霖雨，表示出干旱的大暑之时，都会有天降甘霖之时，一切必须等待时机的到来，才能成事。让你的希望有所依靠的，不就是至诚的祈祷吗？现在的辛苦，必会换得未来的顺遂。",
    "Story": "王猛辅苻坚",
    "Story_Brief": "王猛辅佐苻坚,使前秦成为北方强国。",
    "Items": "事业:大吉;求财:有;功名:显",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Thunder, rain, wind, clouds each have their role, Pray sincerely, don't doubt, I promise you a rainy day, Just when the heat is at its peak.",
    "Detail2_EN": "Nature's weather changes each have their reason—not controlled by humans. Life's fortune and misfortune are the same. You must pray sincerely and let the gods feel your sincerity. 'Rainy day' means a day of rain. 'At the peak of heat' shows when it will rain—during the hottest time. This sign shows: pray sincerely, and heaven will respond at the right time.",
    "Story_EN": "The Advisor",
    "Story_Brief_EN": "A strategist advised a ruler, made his kingdom a northern power, and achieved great success.",
    "Items_EN": "Career: Very Favorable; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 71,
    "Level": "中吉",
    "Content": "喜雀檐前报好音，知君千里欲归心，绣帏重结鸳鸯带，叶落霜凋暮色侵。",
    "Detail1": "此签离而又合。去而复还之象。凡事机兆已动。现有好音。如归家者已通消息。不日间可团聚。自有夫妻谐和之乐。但暮景霜侵。草木零落。必主晚成。及年力衰迟之际也。",
    "Detail2": "通报喜讯的雀鸟在檐前啼叫，预告离家的他即将归来，房间重新再结上喜帐，表示重来一次或是再婚，然而虽然期盼已久的他已回来，然而已到叶落霜凋之时，表示秋冬之日，或是晚年，暮色侵表示一切都已经太晚了。此签表示所占之事无法在早年达成，必会拖至晚年之时，或秋冬之日，而且有重新来过之意。",
    "Story": "苏秦合纵",
    "Story_Brief": "苏秦游说六国合纵,共同抗秦,身佩六国相印。",
    "Items": "事业:大吉;求财:大利;功名:显",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Magpie at the eaves brings good news, I know you long to return from afar, Wedding curtains tied again, Leaves fall, frost comes, evening approaches.",
    "Detail2_EN": "The magpie announcing good news sings at the eaves, foretelling the return of the one who left home. The room is decorated with wedding curtains again, meaning a second chance or remarriage. Though the long-awaited one has returned, it's already the time of falling leaves and frost—meaning autumn and winter, or old age. This sign shows: reunion comes, but timing may be late.",
    "Story_EN": "The Unifier",
    "Story_Brief_EN": "A diplomat persuaded six states to unite against a common enemy, wore six prime minister seals, and gained great fame.",
    "Items_EN": "Career: Very Favorable; Wealth: Great Profit; Achievement: Prominent"
  },
  {
    "number": 72,
    "Level": "中平",
    "Content": "河渠傍路有高低，可叹长途日已西，纵有荣华好时节，直须猴犬换金鸡。",
    "Detail1": "此签险阻多端。事有蹉跌。人防陷害。如行河畔崎岖之路。又值日色将晚。险何如乎。凡事勉强前进。凶不可言。就此中止。庶可免祸。纵有晚景。须遇申酉戌年月日。或申酉戌运限。可冀有成耳。",
    "Detail2": "道路本就崎岖难行，更何况是沿着河渠的坎坷道路，一到日已向西的傍晚，就更难行了，而且处处有危险，只要一脚踩空，则死于非命，所以不可勉强行之，必须就此停止，则可免于招祸，纵使有荣华富贵的时日，也必须等到申酉戌年月日时，才可达到，现在是处于四面楚歌的状况，必须耐心等待时机的到来，千万不可心急一时，否则会招来厄运。",
    "Story": "玄奘西行",
    "Story_Brief": "玄奘西行取经,历经艰险,终得真经,成为一代高僧。",
    "Items": "事业:远行;求财:有;功名:成",
    "Level_EN": "Neutral Path",
    "Content_EN": "River channels by the road have highs and lows, Alas, the long journey, sun sets west, Even in good times of glory, Must wait for monkey and dog to replace golden rooster.",
    "Detail2_EN": "The road is already rough and hard to travel, especially along the river's uneven path. When the sun sets in the west, it's even harder, and everywhere is dangerous. One misstep and you'll die. So don't force it—stop here and you'll avoid disaster. Even in good times, you must wait for the right timing—when monkey and dog replace the golden rooster. This sign warns: don't force things, wait for the right time.",
    "Story_EN": "The Pilgrim",
    "Story_Brief_EN": "A pilgrim journeyed west to obtain scriptures, faced great dangers, finally succeeded, and became a great master.",
    "Items_EN": "Career: Travel; Wealth: Promising; Achievement: Favorable"
  },
  {
    "number": 73,
    "Level": "下下",
    "Content": "忆昔兰房分半钗，而今忽把信音乖，痴心指望成连理，到底谁知事不谐。",
    "Detail1": "此签戒勿轻信。凡事与人有约。始虽和合如意。亦是巧言虚花。终无准实。如婚姻之转瞬败盟也。及早参透。免自扰累。或可另作亡羊补牢之计。若终受愚弄。非徒无益。而受害多矣。人情如此。其可不知悟乎",
    "Detail2": "口头上的盟约已完全失信了，答应之事已不可能完成了。还要痴心妄想成为夫妻，大家都知道这是不可能的事，却只有自己一心想要挽回，当然只会让自己痛苦不堪罢了。此签表示以前的誓约早已变化，越早看透越能及时回头，不必再等下去了，不如认清事实，重新来过，会有一个新的开始。不要再执迷不悟了。",
    "Story": "张良运筹",
    "Story_Brief": "张良运筹帷幄,决胜千里,助刘邦建立汉朝。",
    "Items": "事业:大吉;求财:有;功名:显",
    "Level_EN": "Challenging Phase",
    "Content_EN": "Remember when we shared a hairpin, Now suddenly news is broken, Foolishly hoping to be united, In the end, who knew it wouldn't work?",
    "Detail2_EN": "The verbal promise has completely broken. What was promised can't be fulfilled. You still foolishly hope to become a couple. Everyone knows it's impossible, but only you want to save it. Of course, this only makes you miserable. This sign shows: past promises are broken, don't cling to what's gone. Let go and move on.",
    "Story_EN": "The Strategist",
    "Story_Brief_EN": "A strategist planned from the tent, decided battles from a thousand miles away, and helped establish a great dynasty.",
    "Items_EN": "Career: Very Favorable; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 74,
    "Level": "上吉",
    "Content": "崔巍崔巍复崔巍，履险如夷去复来，身似菩提心似镜，长安一道放春回。",
    "Detail1": "此签事有重险。目前甚属艰难。然赖神明默相。虽在危险之中。如履康庄之路。盖缘平日身具善根。足以感格天意。此时心含智慧。足以权度机宜。故能脱险而亨。行登长安道上。春色满前。正有无限好景。占者唯慎持身心。益加积累。以迓天麻斯善耳。",
    "Detail2": "在这高峻之地行走，就犹如平地般来去自如，这些危险根本就无法影响，平时为人行善，而且心如明镜，表示得到上天的庇佑，将大吉大利，长安一道指通往功名利禄之道，放春回，指春色无边，正等待着你的到来。此签表示虽履险境，但对你完全不受影响，只要心存善念，必得善果，接着而来的是顺畅的吉运。",
    "Story": "管仲治齐",
    "Story_Brief": "管仲辅佐齐桓公,使齐国成为春秋五霸之首。",
    "Items": "事业:大吉;求财:大利;功名:显",
    "Level_EN": "High Resonance",
    "Content_EN": "High and higher, still higher, Walk danger like flat ground, Body like bodhi, heart like mirror, The road to Chang'an brings spring back.",
    "Detail2_EN": "Walking in these high, steep places is like walking on flat ground, coming and going freely. These dangers can't affect you. You usually do good deeds, and your heart is like a bright mirror, meaning you have heaven's protection. Great fortune will come. 'The road to Chang'an' means the path to fame and fortune. 'Spring returns' means good fortune arrives. This sign shows: virtue protects you, all paths are smooth.",
    "Story_EN": "The Administrator",
    "Story_Brief_EN": "A minister advised a ruler, made his state the first of five great powers, and achieved lasting success.",
    "Items_EN": "Career: Very Favorable; Wealth: Great Profit; Achievement: Prominent"
  },
  {
    "number": 75,
    "Level": "中吉",
    "Content": "生前结得好缘姻，一笑相逢情自亲，相当人物无高下，得意休论富与贫。",
    "Detail1": "此签事有前缘。不须劳力。自然遇合凑巧。盖称量彼此之间。彼既脱去俗尘。此相遇可落凡近。是以一见倾心。格外投契。不复在世情贫富间论也。婚姻和合。诸事相宜。道途遂意。谋望皆能如愿矣。",
    "Detail2": "此时正面临一个天大的好机会，这并非是偶然，而是在前世的因缘契合，于此世延续，见到的第一面，就有如失散己久的亲人，有一见如故的感觉，而且对方与自己不论是在外貌或是才德方面，皆不相上下，由于如此的投契，所以贵贱贫富，就己经无所谓了。此签指出会遇到与你相合之人，或是处事顺遂如意，一切就是自然天成。但这都是前世的因缘，要懂得珍惜，才能有良好的轮回。、",
    "Story": "诸葛亮七擒孟获",
    "Story_Brief": "诸葛亮七擒七纵孟获,以德服人,平定南中。",
    "Items": "事业:大吉;求财:有;功名:显",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Good marriage from past life, One smile, love comes naturally, Matching people, no high or low, When happy, don't discuss rich or poor.",
    "Detail2_EN": "You're facing a great opportunity now. This isn't accidental—it's from past life karma continuing in this life. At first sight, it's like meeting a long-lost relative, feeling like old friends. Whether in appearance or inner qualities, you're well-matched, with no high or low. When you're happy together, don't discuss wealth or poverty. This sign shows: destined love, perfect match.",
    "Story_EN": "The Conqueror",
    "Story_Brief_EN": "A strategist captured an enemy seven times and released him seven times, won him over with virtue, and pacified the south.",
    "Items_EN": "Career: Very Favorable; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 76,
    "Level": "中平",
    "Content": "三千法律八千文，此事如何说与君，善恶两途君自作，一生祸福此中分。",
    "Detail1": "此签谋为阴事。神不之告。如法律操自官府。岂得预行宣泄。唯是祸福无门。全凭善恶判断。所为善。自应得福。所为恶。自应得祸。祸福之机。人自知之。将求福而避祸。可不急去恶而迁善哉。",
    "Detail2": "三千法律，指的是罪状条文，八千文，是指律文的内容，这是一般凡人无法了解，也不能事先知道，未来的吉凶，完全决定在现在所为的善恶，神佛无法为你多祈求福份，只有自己的修为才能影响吉凶，一生的祸福都由自己所作为的善恶决定，非他人能决定。此签神明无法有所帮助，未来祸福早已决定在自己，求福避祸，倒不如去恶行善。此签的吉凶完全在各人作为。",
    "Story": "王羲之兰亭",
    "Story_Brief": "王羲之在兰亭写下《兰亭序》,成为天下第一行书。",
    "Items": "功名:成;求财:有;事业:成功",
    "Level_EN": "Neutral Path",
    "Content_EN": "Three thousand laws, eight thousand articles, How can I explain this to you? Good and evil paths you choose, Your life's fortune and misfortune are divided here.",
    "Detail2_EN": "'Three thousand laws' refers to crime articles. 'Eight thousand articles' means legal content. Ordinary people can't understand this or know in advance. Future fortune and misfortune are entirely determined by current good and evil deeds. The gods can't pray for more fortune for you—only your own actions decide. This sign shows: you create your own destiny through your choices.",
    "Story_EN": "The Master",
    "Story_Brief_EN": "A calligrapher wrote at the Orchid Pavilion, created the world's greatest running script, and became immortal.",
    "Items_EN": "Achievement: Favorable; Wealth: Promising; Career: Success"
  },
  {
    "number": 77,
    "Level": "中平",
    "Content": "木有根荄水有源，君当自此究其原，莫随道路人间话，讼则终凶是至言。",
    "Detail1": "此签戒宜谨让。凡事准情酌理。探取根源。自能明其是非。审其进退。切不可听傍人言语。妄构讼端。讼必有凶祸在后。至此时悔之晚矣。何如慎之于先之为得也。凡事宜止不宜进。宜解不宜结。宜静不宜躁。占者慎之。",
    "Detail2": "树木必须扎下深根，才能稳稳地树立，潺潺的流水也要有个源头，河流才能源源不绝，这是天地万物不变的道理，必须自己探究其原因，去恶从善则能趋吉避凶，为人仁慈则能长寿。千万不要道听途说，傍人在耳边劝说，似乎是有道理，其实都是巧言令色，如因此而涉诉讼，则有厄运，千万要记得，不可涉及讼事，关起耳朵，不要听别人的小道消息，从根源修德行善，才是最根本的道理。",
    "Story": "苏武归汉",
    "Story_Brief": "苏武在匈奴十九年,持节不屈,终得归汉。",
    "Items": "事业:坚持;求财:无;婚姻:待时",
    "Level_EN": "Neutral Path",
    "Content_EN": "Trees have roots, water has source, You should trace to the origin, Don't follow what people say, Lawsuits always end badly—this is truth.",
    "Detail2_EN": "Trees must have deep roots to stand firmly. Flowing water must have a source for the river to flow continuously. This is the unchanging truth of all things. You must investigate the cause yourself. Turn from evil to good, and you'll avoid misfortune and gain fortune. Be kind, and you'll live long. Don't follow others' words. Lawsuits always end badly—this is the truth. This sign teaches: find the root cause, avoid lawsuits.",
    "Story_EN": "The Returned",
    "Story_Brief_EN": "An envoy remained loyal for nineteen years in captivity, holding his staff, and finally returned home.",
    "Items_EN": "Career: Perseverance; Wealth: Limited; Relationships: Await Timing"
  },
  {
    "number": 78,
    "Level": "下下",
    "Content": "家道丰腴自饱温，也须肚里立乾坤，财多害己君当省，福有胚胎祸有门。",
    "Detail1": "此签家道虽然温饱。宜自谨守。不可倚强欺弱。主有口舌是非。更防贪求不已。致生后祸。祸福无不自己求之。可不慎乎。",
    "Detail2": "家庭环境富裕。所以不必为了三餐温饱而烦恼，当然心思就无所事事，虽然如此，还是要有自己的定见，如果随周围的宵小起舞，则会造成祸根，家中过于有钱，只是让自己更加浪费，不懂珍惜的结果会反害自己，祸福自有源起，从善则能招福，胡作非为地使坏，只会让自己走入灾祸之中。此签告诫祸福自找，必须懂得修为，去恶从善，修得善果。不论福祸，必定自我承受。",
    "Story": "韩信胯下",
    "Story_Brief": "韩信受胯下之辱,后成为大将军,但最终被害。",
    "Items": "事业:先辱后荣;求财:有;功名:显",
    "Level_EN": "Challenging Phase",
    "Content_EN": "Family is rich, well-fed and warm, But you must have principles within, Too much wealth harms you, I advise you to reflect, Fortune has seeds, misfortune has doors.",
    "Detail2_EN": "Your family is wealthy, so you don't worry about food and warmth. Of course, your mind has nothing to do. Even so, you must have your own principles. If you dance with the villains around you, you'll create the root of disaster. Having too much money at home only makes you more wasteful and harms yourself. This sign warns: wealth without virtue brings disaster. Cultivate inner principles.",
    "Story_EN": "The Humiliated",
    "Story_Brief_EN": "A warrior endured humiliation under someone's crotch, later became a great general, but was eventually killed.",
    "Items_EN": "Career: Honor After Humiliation; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 79,
    "Level": "中平",
    "Content": "干亥来龙仔细看，坎居午向自相安，若移丑艮阴阳逆，门户凋零家道难。",
    "Detail1": "此签凡事宜依理顺行。不可妄意强求。反招祸患。如相地者。干亥来龙。自以坐坎向午为顺。若独执偏见。改作丑艮作穴。是为阴阳背逆。岂不致门户凋零之咎乎。此以见吉可趋。凶可避。慎无颠倒错乱。自贻伊戚也。",
    "Detail2": "为人处事必须依照天理。干亥来龙，指西北方位是吉位，而坐北朝南的方向是平安吉利的坐向。若无视于天理的运行，硬要移居东北方，则与西北吉位造成直角，是非常不利的方位，若执意要居于东北方，则会面临家道凋零，而且凡事不顺遂，则对家中人口有损。在亥子午年时运势良好，但在丑寅年则较不顺。",
    "Story": "张良辟谷",
    "Story_Brief": "张良功成身退,学习辟谷,成为神仙。",
    "Items": "事业:功成身退;求财:有;功名:显",
    "Level_EN": "Neutral Path",
    "Content_EN": "Northwest dragon, look carefully, North facing south is naturally safe, If you move to northeast, yin and yang reverse, Family declines, fortune fails.",
    "Detail2_EN": "In dealing with people and affairs, you must follow heaven's principles. 'Northwest dragon' means the northwest direction is auspicious. Facing north with south behind is a safe and auspicious orientation. If you ignore heaven's principles and insist on moving to the northeast, it forms a right angle with the northwest auspicious position—a very unfavorable direction. Your family will decline and fortune will fail. This sign warns: follow natural principles, don't go against them.",
    "Story_EN": "The Ascetic",
    "Story_Brief_EN": "A strategist succeeded, then retired to practice asceticism, and became immortal.",
    "Items_EN": "Career: Retire After Success; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 80,
    "Level": "中平",
    "Content": "一朝无事忽遭官，也是门衰坟未安，改换阴阳移祸福，劝君莫作等闲看。",
    "Detail1": "此签宜趋吉避凶。革故从新。不可妄为。亦不可坐守。始以无故而得祸。后亦可以作善而致福。如人家坟宅未安。必须改换阴阳方向。乃可化凶为吉也。若自己毫无转动。福何由而集。祸何自而消乎。",
    "Detail2": "闲来无事却突遭是非缠身，无风不起浪，绝非无中生有，此次缠讼起因于阴阳宅的问题，目前的风水有所不利，只要改变阴阳宅的坐向方位，则可转祸为福，或许你会心存疑虑，无法认同，如果你等闲视之，则祸患无穷，若能姑且相信，作适当的改变，则会有很明显的转变，不妨试试。此签表示必须有所改变，不可等闲视之，或心存怀疑，起身动动，运势也会跟着动动。",
    "Story": "姜太公遇文王",
    "Story_Brief": "姜太公在渭水垂钓,遇周文王,辅佐建立周朝。",
    "Items": "事业:大吉;求财:有;功名:显",
    "Level_EN": "Neutral Path",
    "Content_EN": "Suddenly trouble comes when all was calm, Family decline, grave not settled, Change yin and yang, move fortune and misfortune, I advise you, don't take this lightly.",
    "Detail2_EN": "When all was peaceful, trouble suddenly came. No wind, no waves—this didn't come from nothing. This lawsuit comes from problems with yin and yang dwellings. Current feng shui is unfavorable. Just change the orientation of yin and yang dwellings, and you can turn misfortune into fortune. You may have doubts and can't believe it, but this is the truth. This sign shows: feng shui affects fortune—adjust it, and fortune will change.",
    "Story_EN": "The Encounter",
    "Story_Brief_EN": "An old fisherman waited by the river, fishing for those willing to be caught. He met a wise king and helped establish a great dynasty.",
    "Items_EN": "Career: Very Favorable; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 81,
    "Level": "中吉",
    "Content": "假君财物自当还，谋赖欺心他自奸，幸有高台明月镜，请来照对破机关。",
    "Detail1": "此签被人欺凌。暂时耐守。自可昭雪。如人负欠不还。多方谋赖。理曲在人。我何畏哉。自有清正官司在上。恰似高台明镜。一经照察。机关立破。谋赖者从此败矣。此以见凡事当依本分。毋逞狡诈。本分到处可行。狡诈适自害其身而已矣。",
    "Detail2": "有借有还是人之常情，借东西给别人，希望别人自己会奉还，然而他人存心狡诈，故意耍赖拖欠，你也无可奈何，幸亏还有天理，犹如高台上的明镜，照亮所有真理，也照穿了邪恶的机关，狡诈的心可以欺负人，但无法骗过天理，最终还是斗不过天理，迟来的正义还是会来，得到平反，收回了借出的财物。此签告诫天网诙诙，疏而不漏，不是不报，时候未到，不可有故意占人便宜的心态。",
    "Story": "范蠡三迁",
    "Story_Brief": "范蠡三迁致富,成为商圣,功成身退。",
    "Items": "事业:大吉;求财:大利;婚姻:成",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Borrowed goods should be returned, But he schemes and cheats, Fortunately there's a bright mirror on high, Come and see, it breaks all schemes.",
    "Detail2_EN": "Borrowing and returning is human nature. When you lend something, you hope the person will return it. But the other person is cunning and deliberately delays repayment. You can't do anything about it. Fortunately, there's heavenly justice, like a bright mirror on a high platform, illuminating all truth and exposing all evil. This sign shows: justice will prevail, truth will be revealed.",
    "Story_EN": "The Wanderer",
    "Story_Brief_EN": "A strategist moved three times to build wealth, became a legendary merchant, succeeded, then retired.",
    "Items_EN": "Career: Very Favorable; Wealth: Great Profit; Relationships: Favorable"
  },
  {
    "number": 82,
    "Level": "上吉",
    "Content": "彼亦俦中一辈贤，劝君特达与周旋，此时宾主欢相会，他日王侯却并肩。",
    "Detail1": "此签凡事早植因缘。后此自有莫大利益。如往来俦类中。现有一贤士在前。必须特与订交。厚相结纳。日后此人得志。乃是王侯之贵。幸得以故人肩随上下。托末光而附尾后。易易事耳。若待临时攀扶。岂有济乎。凡事予则吉观此益信。",
    "Detail2": "在往来的朋友当中，有一位贤能之人，但此时并没有特别出色的表现或得到赏识。此时你必须特别与他多加交往，不妨以主人的身份多加款待他，并建立起深厚的交情，以后当他成为王宫侯爵之士，你依然是在他周围的贵客，而且会受到他的提携。此签表示他日的丰收，必须在今日就种下因缘，等到他人升至高官再去拉关系，一切都太迟了，必须慎选友人交往。",
    "Story": "谢安东山",
    "Story_Brief": "谢安隐居东山,后出山辅佐东晋,淝水之战大败前秦。",
    "Items": "事业:大吉;求财:有;功名:显",
    "Level_EN": "High Resonance",
    "Content_EN": "He is a worthy one among friends, I advise you to treat him specially, Now host and guest meet joyfully, One day you'll stand side by side as nobles.",
    "Detail2_EN": "Among your friends, there's one worthy person, but he hasn't shown outstanding performance or been recognized yet. You must especially interact with him more, treat him as a host would, and build deep friendship. Later, when he becomes a high official or noble, you'll stand side by side with him. This sign shows: invest in worthy friends now, future rewards will come.",
    "Story_EN": "The Retired Strategist",
    "Story_Brief_EN": "A strategist retired to the eastern mountains, later came down to help the empire, and won a great battle.",
    "Items_EN": "Career: Very Favorable; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 83,
    "Level": "下下",
    "Content": "随分堂前赴粥饘，何须妄想苦忧煎，主张门户诚难事，百岁安闲得几年。",
    "Detail1": "此签宜随分退守。恰得安常处顺之乐。若贪现前而图意外。不唯无益。更增烦恼而已。虽则家计艰难。然安闲境地。不可多得。何不爱惜光阴。甘守清况之为得乎。凡事恬静则吉。妄动则凶。",
    "Detail2": "即使只是一碗清粥，都要懂得珍惜，将自己的欲望降至最低，则能随遇而安，若苦苦追求福禄财宝，也只是多加妄想，让自己陷入痛苦的煎熬。如果想要自己跟富贵人家相比，只是更加为难自己罢了，实在是作不到，又何必让自己痛苦，人生在世短短几年，求的是平安闲适的生活，目前虽然物质生活较不充裕，但日子过得还算清闲，如能自得其乐，不也是很好吗？",
    "Story": "王猛辅秦",
    "Story_Brief": "王猛辅佐苻坚,使前秦统一北方,成为强国。",
    "Items": "事业:大吉;求财:有;功名:显",
    "Level_EN": "Challenging Phase",
    "Content_EN": "Be content with porridge at home, Why worry and suffer with vain hopes? Running a household is truly hard, How many years of peace in a hundred?",
    "Detail2_EN": "Even just a bowl of plain porridge should be cherished. Lower your desires to the minimum, and you can be content wherever you are. If you desperately pursue wealth and treasure, you're only adding delusions and falling into painful suffering. If you want to compare yourself with wealthy families, you'll only add more pain. This sign teaches: contentment is true wealth.",
    "Story_EN": "The Advisor",
    "Story_Brief_EN": "A strategist advised a ruler, helped unify the north, and made the kingdom a powerful state.",
    "Items_EN": "Career: Very Favorable; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 84,
    "Level": "中平",
    "Content": "君家事绪更纷然，当局须知一着先，长舌妇人休酷听，力行礼义要心坚。",
    "Detail1": "此签示人扼要争先之道。头绪虽烦。目应批却遵窍。恰得妙着。尽先布置。恐有阴私小人。从中挑拨。不可过听。总须自作主张。依理而行之。积久勿替。则纷烦定而事绪理矣。凡事不可游移无主。持正有守则吉，治家者切不可听信妇人之言。",
    "Detail2": "目前处于危难之中，此时必须下狠招，就好比是下棋者，经过深思谨慎地下，这步棋则关系了全局的成败，周围的耳语不必理会，尤其是家中女人，不要理会她的言论，身体力行礼义之事，而且不可怠惰，必须持之以恒，才能度过此时的难关。此签告诫不可听信也人之言，尤其是家中妇人，要更加小心处置。",
    "Story": "张良拾履",
    "Story_Brief": "张良为黄石公拾履,通过考验,获得太公兵法。",
    "Items": "功名:成;求财:有;事业:得助",
    "Level_EN": "Neutral Path",
    "Content_EN": "Your family affairs are more chaotic, You must make the first move, Don't listen to the long-tongued woman, Practice righteousness with firm heart.",
    "Detail2_EN": "You're in danger now. You must make a decisive move, like a chess player who thinks carefully before making a move that determines the whole game's outcome. Don't listen to the whispers around you, especially from women in the family. Don't listen to their words. Practice righteousness with your body and keep a firm heart. This sign shows: decisive action needed, ignore gossip.",
    "Story_EN": "The Student",
    "Story_Brief_EN": "A young man picked up shoes for an old master, passed the test, and received the art of strategy.",
    "Items_EN": "Achievement: Favorable; Wealth: Promising; Career: Get Help"
  },
  {
    "number": 85,
    "Level": "中平",
    "Content": "一春风雨正潇潇，千里行人去路遥，移寡就多君得计，如何归路转无聊。",
    "Detail1": "此签宜守分安命。不可妄求。如春天风雨交加。不待晴霁。于此急迫远行。不知几历艰险。究竟事与愿违。算在意中。失在意外。空受劳苦而已。此贪求躁进之害也。知几者其慎之。",
    "Detail2": "目前去路风雨飘摇，阻挡着前去之路，然而不等到雨过天晴之日即急于出发，只是让自己多加受苦罢了，只要想动则会受阻。看到别人的作法则躁进跟随，那知道去了之后又不如自己想象中容易，不管你如何计划，还是敌不过天数已定，最后无济于事，败兴而归，这又有什么意义呢？倒不如一开始就不要做，还可保有平安闲适的生活。此签告诫人不可只想要前进，而不知如何退守，有时想想如何全身而退，可能会是最好的方法。",
    "Story": "韩信拜将",
    "Story_Brief": "韩信被刘邦拜为大将,助其建立汉朝,但最终被害。",
    "Items": "事业:大吉;求财:有;功名:显",
    "Level_EN": "Neutral Path",
    "Content_EN": "Spring wind and rain are raging, Traveler goes a thousand miles, You gain by moving from few to many, But how boring the return journey becomes.",
    "Detail2_EN": "The road ahead is stormy, blocking your way. But if you rush to leave before the rain clears, you'll only suffer more. If you want to move, you'll be blocked. Seeing others' methods, you rush to follow, but after going, you find it's not as good as your own. This sign warns: don't rush in bad weather, wait for clear skies. Don't follow others blindly.",
    "Story_EN": "The General",
    "Story_Brief_EN": "A general was appointed by a ruler, helped establish a dynasty, but was eventually killed.",
    "Items_EN": "Career: Very Favorable; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 86,
    "Level": "上吉",
    "Content": "一般行货好招邀，积少成多自富饶，常把他人比自己，管须日后胜今朝。",
    "Detail1": "此签凡事应渐进。不可欲速。不可欺心。如贸易者。虽值物货当行。亦宜为人设想。两得其平。自然渐入佳境。若专求利己。必致损人。天道岂佑之乎。",
    "Detail2": "平常流通的货物，只要利润适当，则可招来许多买主，所谓薄利多销，如此则能积少成多，时间累积久了，自能成为富裕之人，经常设身处地为他人着想。不蓄意剥削他人利益，未来一定会比现在更好，这是天理自有定数，但已成为富裕之人，千万要待人以仁，为富不仁者，自断后福。此签告诫必须循序渐进，保有仁心，富裕幸福的日子则可持久。",
    "Story": "管仲射钩",
    "Story_Brief": "管仲曾射中齐桓公的带钩,但桓公不计前嫌,重用管仲。",
    "Items": "事业:得贤;求财:有;功名:显",
    "Level_EN": "High Resonance",
    "Content_EN": "Common goods attract many buyers, Small profits accumulate to wealth, Always compare yourself to others, Surely tomorrow will beat today.",
    "Detail2_EN": "Common circulating goods, as long as the profit is appropriate, will attract many buyers. Small profits, large sales—this way you can accumulate little by little. Over time, you'll naturally become wealthy. Always put yourself in others' shoes. Don't deliberately exploit others' interests. In the future, you'll surely surpass today. This sign shows: honest business, steady growth.",
    "Story_EN": "The Forgiven",
    "Story_Brief_EN": "A minister once shot an arrow that hit a ruler's belt hook, but the ruler forgave him and trusted him greatly.",
    "Items_EN": "Career: Get Talent; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 87,
    "Level": "中平",
    "Content": "阴里详看怪尔曹，舟中敌国笑中刀，籓篱剖破浑无事，一种天生惜凤毛。",
    "Detail1": "此签示人光明正直。勿为尔诈我虞之行。胸中既无畛域。天下皆成一家。到处同声相应。同气相求。何不利之有。若以相倾相轧为能。终至两败俱伤。未有能善其后者。人可不知戒哉。",
    "Detail2": "从暗中观察对方的所作所为，了解到敌我的分别，就像是同在船上，却心生暗算，虽笑脸迎人，却是笑里藏刀，外在表现得非常亲切，但内心却防卫心态深重，无法与之交心。此时放下心中的隔阂，排除不必要的干扰，以真心相待，当作无事，看到光彩耀眼的凤毛，则会自然而然由内心发出怜惜之心，与人相处就是如此，放下心中的阻隔，彼此则可以同舟共济，化凶为吉。",
    "Story": "苏秦刺股",
    "Story_Brief": "苏秦发奋读书,以锥刺股,终成纵横家,身佩六国相印。",
    "Items": "功名:成;求财:有;事业:成功",
    "Level_EN": "Neutral Path",
    "Content_EN": "Watch carefully in the shadows, Enemy in the boat, knife in the smile, Break through the fence, all is safe, One kind of nature, cherish the phoenix feather.",
    "Detail2_EN": "Observing the other's actions from the shadows, you understand the difference between enemy and friend. Like being on the same boat but plotting against each other, smiling faces hide knives. The outside shows great friendliness, but inside there's deep defensive mentality—you can't connect heart to heart. Now let go of your guard, break through the fence, and all will be safe. This sign shows: let down your guard, true connection is possible.",
    "Story_EN": "The Diligent",
    "Story_Brief_EN": "A scholar studied hard, pricking his thigh with an awl to stay awake, became a master strategist, and wore six prime minister seals.",
    "Items_EN": "Achievement: Favorable; Wealth: Promising; Career: Success"
  },
  {
    "number": 88,
    "Level": "上吉",
    "Content": "从前作事总徒劳，才见新春喜气遭，百计营求都得意，更须守己莫心高。",
    "Detail1": "此签时运将至。所谋必就转瞬交春之后。万物发生。人事亦得喜悦。向者难而今者易。向者塞而今者通。志愿无不畅遂。快矣足矣。然始也可由剥以使之复继也。亦可由复以至否。此时须识持盈保泰之道。方克有终。是以君子慎之。",
    "Detail2": "过去常常都要做徒劳无功之事，凡事都有所阻滞，在交春之际，突然间转运了，感受到喜气洋洋的气氛，而且做什么事都异常地顺遂，凡事心想事成，作什么都成功如意，此时必须更虚心待人，不可因此就趾高气昂，要更安分守己，得意忘形则会破坏好运，此签表示新春之时，即转好运之时，必须把握好运，不要因一时的志得意满而浪费了大好运。",
    "Story": "张骞通西域",
    "Story_Brief": "张骞出使西域,开辟丝绸之路,促进中外交流。",
    "Items": "事业:远行;求财:有;功名:显",
    "Level_EN": "High Resonance",
    "Content_EN": "All past efforts were in vain, Just as spring arrives with joy, All plans succeed now, But stay humble, don't be proud.",
    "Detail2_EN": "In the past, you often did things in vain, everything was blocked. But when spring arrives, fortune suddenly turns. You feel joy, and everything goes unusually smoothly. Everything you wish for comes true, everything you do succeeds. But now you must be even more careful—stay humble, don't be arrogant, don't show off. This sign shows: fortune has turned, but humility preserves it.",
    "Story_EN": "The Pathfinder",
    "Story_Brief_EN": "An envoy journeyed to the western regions, opened the Silk Road, and promoted exchange between China and the West.",
    "Items_EN": "Career: Travel; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 89,
    "Level": "中吉",
    "Content": "樽前无事且高歌，时未来兮奈若何，白马渡江虽日暮，虎头城里看巍峨。",
    "Detail1": "此签示人隐忍以待时。藏器以待用。不可急。急则颠。不可愤。愤则败。不可躁。躁则陷。是以君子有处困之道。不忧勤惕厉道之经。饮食燕乐道之权。必通经而达权。急来以缓受之。逆来以顺受之。斯出险济屯之道也。一旦快马挥鞭。龙腾虎变。乃真不可方物矣。",
    "Detail2": "目前尚不得志，但不可因此而消沈，不如自我排解，高歌取乐，只能等待时机。直到得势之时，已到了晚年时期，依然可以得到至高的名利。此签表示必须忍耐待时，如果无法以乐观的心态等待，则只能含恨一生，而且破坏了老年的好运。白马也有表示年月的意思，指的是马年或马月，将是可以转运的时机。",
    "Story": "玄奘取经",
    "Story_Brief": "玄奘西行取经,历经九九八十一难,终得真经,成为一代高僧。",
    "Items": "事业:远行;求财:有;功名:成",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Sing high before the wine, nothing to do, Time hasn't come, what can you do? White horse crosses river though day is late, In Tiger City, see the grandeur.",
    "Detail2_EN": "You're not successful yet, but don't be discouraged. Better to console yourself, sing and find joy. You can only wait for the right time. Until you gain power, it will be old age, but you can still gain the highest fame and fortune. This sign shows you must be patient and wait. If you can't stay optimistic, you'll only make things worse. Wait—success comes, even if late.",
    "Story_EN": "The Pilgrim",
    "Story_Brief_EN": "A pilgrim journeyed west to obtain scriptures, faced eighty-one trials, finally succeeded, and became a great master.",
    "Items_EN": "Career: Travel; Wealth: Promising; Achievement: Favorable"
  },
  {
    "number": 90,
    "Level": "中平",
    "Content": "崆峒城里事如麻，无事如君有几家，劝汝不须勤致祷，徒营生事苦咨嗟。",
    "Detail1": "此签境地宽舒。尽可安常处顺。消受太平之福。若格外富贵荣华。乃由人家积功累德所致。非可勉强贪求。只须反求自己。何得妄渎神明。若自作不靖。平空生事。求如现在安闲不可复得。有不辗转愁叹者乎。悟开此理。急将贪求之念。易为积德之计。则幸矣。",
    "Detail2": "能够像你无事安闲度日者，实在没有几个人，你现在的闲适，是得自先人的积德累善而来，无法强求，如果你无法满足现状，还汲汲营营地想要荣华富贵，求天告神，只是徒增烦恼罢了，这个贪念会造成诸多劳苦，而且后悔也来不及，必须看开此点，及早醒悟，才得以安闲度日，否则将白忙一场，甚至劳碌终生。",
    "Story": "诸葛亮出山",
    "Story_Brief": "诸葛亮出山辅佐刘备,三分天下,成为一代名相。",
    "Items": "事业:大吉;求财:有;功名:显",
    "Level_EN": "Neutral Path",
    "Content_EN": "In the city, affairs are tangled, Few are as carefree as you, I advise you not to pray too much, Just add trouble and sorrow.",
    "Detail2_EN": "Few people can be as carefree and idle as you. Your current leisure comes from your ancestors' accumulated virtue—it can't be forced. If you can't be satisfied with the present and desperately seek wealth and honor, praying to heaven and gods will only add trouble. This sign shows: your peace is a blessing—cherish it, don't seek more trouble.",
    "Story_EN": "The Sage",
    "Story_Brief_EN": "A sage came down from the mountain, helped a ruler, divided the world into three, and became a legendary prime minister.",
    "Items_EN": "Career: Very Favorable; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 91,
    "Level": "中吉",
    "Content": "佛说淘沙始见金，只缘君子苦劳心，荣华总得诗书效，妙里功夫仔细寻。",
    "Detail1": "此签凡有谋望。皆得成就。但须涉历勤苦方可。故以淘沙见金为比。沙非容易淘。金非容易得。人生苦志读书。亦复如是。爵禄荣华。皆从诗书中得力。君子忧道不忧贫。唯自求功夫精到。定有效验。若作辍无常。内鲜实功。是坐地待金。岂有冀哉。",
    "Detail2": "努力必有收获，但并非容易，必须付出心力，才能有所得，就像是读书人一样，努力用功，书中自有颜如玉，书中自有黄金屋，但必须经过辛勤的劳苦，未来功名皆从书中得来，其中的奥妙，必须细细思量，也就是辛勤用功，才得以功成名就。此签表示没有不劳而获，必须经过一番劳苦，富贵名利才会随之而至。",
    "Story": "王猛扪虱",
    "Story_Brief": "王猛扪虱谈天下,被苻坚重用,助前秦统一北方。",
    "Items": "事业:得贤;求财:有;功名:显",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Buddha says: wash sand to find gold, Only because the gentleman works hard, Glory comes from books, Search carefully for the subtle skill.",
    "Detail2_EN": "Hard work will bring rewards, but it's not easy. You must put in effort to gain. Like a scholar, study hard—books contain beauty and gold, but you must go through hard work. Future fame and fortune all come from books. The subtle skill within must be searched carefully. This sign shows: study hard, rewards come from knowledge.",
    "Story_EN": "The Strategist",
    "Story_Brief_EN": "A strategist discussed the world while picking lice, was trusted by a ruler, and helped unify the north.",
    "Items_EN": "Career: Get Talent; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 92,
    "Level": "中下",
    "Content": "今年禾谷不如前，物价喧腾倍百年，灾数流行多疫疠，一阳复后始安全。",
    "Detail1": "此签年运欠吉。诸事不利。耕作防凶年。置货防折本。是非曰有。病患淹缠。交冬至后。方得清静之象。凡事凶多吉少。祸早福迟。最宜审慎。",
    "Detail2": "今年的收成与往年不能比，实在是少得可怜，因为天灾所致的歉收，造成了物价的大幅波动，这是百年来的大变动，因为无法防止的天灾，造成了传染病的流行，而且有致命的危险，必须到冬至时节，才得以控制，慢慢地回复以往。此签表示今年运气不佳，诸事不顺遂，必须要到年尾冬至，才能较平顺，然而一年即将过完了，表示凶多吉少，必须要特别谨慎小心。",
    "Story": "苏秦六国封相",
    "Story_Brief": "苏秦游说六国,合纵抗秦,身佩六国相印,名扬天下。",
    "Items": "事业:大吉;求财:大利;功名:显",
    "Level_EN": "Neutral Path",
    "Content_EN": "This year's harvest is worse than before, Prices soar, a hundred years' change, Disasters spread, many plagues, Only after the solstice will it be safe.",
    "Detail2_EN": "This year's harvest can't compare to previous years—it's pitifully small. Natural disasters caused poor harvests, leading to huge price fluctuations—a change not seen in a hundred years. Unpreventable natural disasters caused epidemics to spread, with fatal danger. Only after the winter solstice will it be safe. This sign shows: natural disasters bring hardship, but relief comes after the solstice.",
    "Story_EN": "The Diplomat",
    "Story_Brief_EN": "A diplomat persuaded six states to unite, wore six prime minister seals, and gained great fame.",
    "Items_EN": "Career: Very Favorable; Wealth: Great Profit; Achievement: Prominent"
  },
  {
    "number": 93,
    "Level": "中吉",
    "Content": "春来雨水大连绵，入夏晴干雨又愆，节气直交三伏始，喜逢滂沱足田园。",
    "Detail1": "此签谋望。起首及中间不免阻滞。末后方得顺利。如春天雨水多。亦不为好。夏天晴干太甚。亦属急迫。一旦时雨滂沱。顿觉生机勃勃。喜出望外。人久困得时者。似此景像。岂非盈虚消长之听乎。自然吉凶祸福之主于气数者乎。",
    "Detail2": "春天是一年的开始，连绵的春雨一直下不停，到了夏季时，却又干旱无雨，实在是时运不济，春天洒下的种籽，因为太多的雨水，无法完全生长，到了夏天成长的时期，须要较多的雨水，反而又干旱，势必今年的收成会有影响，好不容易到了仲夏时期，节气转换之时，来了场滂沱大雨，有久旱逢甘霖的意思，足以滋润干涸的农作物，解决了危机。",
    "Story": "张良运筹",
    "Story_Brief": "张良运筹帷幄,决胜千里,助刘邦建立汉朝,功成身退。",
    "Items": "事业:大吉;求财:有;功名:显",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Spring brings continuous heavy rain, Summer is dry, rain is lacking, When the three hot periods arrive, Welcome the downpour that fills the fields.",
    "Detail2_EN": "Spring is the beginning of the year. Continuous spring rain keeps falling. But in summer, it's dry with no rain—fortune is truly poor. Seeds planted in spring can't fully grow because of too much rain. In summer, the growth period needs more rain, but there's drought. Only when the three hot periods arrive will welcome heavy rain come, filling the fields. This sign shows: timing matters—wait for the right season.",
    "Story_EN": "The Strategist",
    "Story_Brief_EN": "A strategist planned from the tent, decided battles from a thousand miles away, helped establish a dynasty, then retired.",
    "Items_EN": "Career: Very Favorable; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 94,
    "Level": "中吉",
    "Content": "一般器用与人同，巧斫轮舆梓匠工，凡事随缘且随分，秋冬方遇主人翁。",
    "Detail1": "此签言有才技。且须待时。如梓匠轮舆。虽能备物致用。不可急迫求售。必且听诸自然。安分等待。久久或有投合之处。苟未及时。而妄图躁进。岂有当乎。",
    "Detail2": "平时所用的工具，和人是一样的，制造器具的精巧工匠，虽然有着巧妙的手工，但没有须要用到器具时，也只能默默地钻研自己的手艺，只能随遇而安，固守本分，无法强求，一直到秋冬季节，遇到了须要用这个器具的主人，才得以发挥工匠的手艺。此签表示平时专注在手艺方面的钻研，等待时机的到来，时间到了，就会遇到赏识工匠手艺的主人出现。",
    "Story": "管仲治齐",
    "Story_Brief": "管仲辅佐齐桓公,使齐国成为春秋五霸之首,功勋卓著。",
    "Items": "事业:大吉;求财:大利;功名:显",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "Tools are the same as others', Skilled craftsman makes wheels and carts, Everything follows fate and duty, Autumn and winter meet the master.",
    "Detail2_EN": "The tools you usually use are the same as others'. The skilled craftsman who makes tools has clever hands, but when there's no need for tools, he can only silently practice his craft. He can only be content with his situation, stay in his place, can't force things. Only when autumn and winter come will he meet the master who needs his skills. This sign shows: wait for the right time, your skills will be needed.",
    "Story_EN": "The Administrator",
    "Story_Brief_EN": "A minister advised a ruler, made his state the first of five great powers, and achieved lasting success.",
    "Items_EN": "Career: Very Favorable; Wealth: Great Profit; Achievement: Prominent"
  },
  {
    "number": 95,
    "Level": "中吉",
    "Content": "知君袖里有骊珠，生不逢辰亦强图，可叹头颅已如许，而今方得贵人扶。",
    "Detail1": "此签名利晚成。凡事皆主迟得。如骊珠在手。似宜声价十倍。然机缘未至。强图奚益。必待头颅老大之后。方得贵人扶持。所谋遂意。亨困迟速间。天实主之。岂可冀幸哉。",
    "Detail2": "明明知道你是个有实力的人，偏偏生不逢时，当机缘未到之时，勉强也是没有用的，一直到两鬓斑白之时，才得到贵人的赏识，所有的名利富贵，都必须在晚年才有所成。在年轻时必须多多充实自己的能力，也许必须度过漫长的蛰伏期，但总有出头天的时候，不可怀忧丧志，晚成就总比一生没有成就要来得好，必须顺势而为。",
    "Story": "诸葛亮七擒",
    "Story_Brief": "诸葛亮七擒七纵孟获,以德服人,平定南中,巩固蜀汉。",
    "Items": "事业:大吉;求财:有;功名:显",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "I know you have a pearl in your sleeve, Born at the wrong time, still you strive, Alas, your head is already gray, Only now do you meet a noble helper.",
    "Detail2_EN": "I clearly know you're a capable person, but you were born at the wrong time. When opportunity hasn't come, forcing things is useless. Only when your temples are gray do you get a noble person's recognition. All fame, fortune, and wealth must be achieved in old age. In youth, you must endure hardship and wait. This sign shows: late success, but success nonetheless.",
    "Story_EN": "The 诸葛亮七擒",
    "Story_Brief_EN": "A strategist captured an enemy seven times and released him seven times, won him over with virtue, pacified the south, and consolidated the kingdom.",
    "Items_EN": "Career: Very Favorable; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 96,
    "Level": "上吉",
    "Content": "婚姻子媳莫嫌迟，但把精神仗佛持，四十年前须报应，功圆行满有馨儿。",
    "Detail1": "此签诸事迟滞。赖有佛力暗持。皆由积累有素。早经感应。直待功行圆满之后。自有颖秀佳儿。为之光大门户，不过稍迟。必无爽报。人可不以存心阴骘为要哉。占者合此则吉。否则急自修省可也。",
    "Detail2": "结婚生子乃是人生大事，在这方面会比较晚成，但还是会有结果，不要抱怨，可以把精神寄托在神明，从事善行，则可招来吉运，现在的报应是累积了前四十年的因果，也就是现在的祸福是自己过去善恶的结果，由于过去一直行善，所以在功德圆满之时，能喜获麟儿，凡事不可强求，一切都是自己所累积的结果。",
    "Story": "王羲之临池",
    "Story_Brief": "王羲之临池学书,池水尽黑,终成书圣,名垂千古。",
    "Items": "功名:成;求财:有;事业:成功",
    "Level_EN": "High Resonance",
    "Content_EN": "Marriage and children, don't complain they're late, But rely on the Buddha with your spirit, Forty years of karma must be repaid, When merit is complete, you'll have a good son.",
    "Detail2_EN": "Marriage and children are life's great matters. In this area, you'll achieve late, but there will be results. Don't complain. You can entrust your spirit to the gods, do good deeds, and this will bring good fortune. Your current karma is accumulated from the past forty years—meaning your current situation is the result of past actions. When your merit is complete, you'll have a good son. This sign shows: late but certain, virtue brings rewards.",
    "Story_EN": "The Calligrapher",
    "Story_Brief_EN": "A calligrapher practiced by the pond until the water turned black, eventually became the master of calligraphy, and achieved immortality.",
    "Items_EN": "Achievement: Favorable; Wealth: Promising; Career: Success"
  },
  {
    "number": 97,
    "Level": "上上",
    "Content": "五十功名心已灰，那知富贵逼人来，更行好事存方寸，寿比岗陵位鼎台。",
    "Detail1": "此签功名晚成。应在五十以外。少壮时有志不遂。衰迟后无意得来。此乃天数所定。然不可因此自足。须更力加培植。事事积德。处处存心。古称现在之福。如点灯。渐点渐消。积来之福如添油。越添越盛。由是增寿加禄。后福未艾。虽晚遇更胜少壮也。圣言不虚。信之宝之。",
    "Detail2": "过了五十岁之后，对于功名利禄已经快要灰心了，怎么会知道迟来的富贵接着而来，盛况在前，必须更行善积福，将随时心存善念，则寿命会更加延长，地位也会更加崇高。此签表示一切功名皆晚成，在中年之后富贵将不请自来，将善行存于心中，是保有富贵的最佳方式，此后将一切顺遂如意。",
    "Story": "苏武持节",
    "Story_Brief": "苏武持节不屈,在匈奴十九年,终得归汉,成为忠臣典范。",
    "Items": "事业:坚持;求财:无;婚姻:待时",
    "Level_EN": "Supreme Harmony",
    "Content_EN": "At fifty, fame and fortune seem hopeless, Who knew wealth would come pressing? Do more good deeds, keep a good heart, Life as long as mountains, position as high as the tripod.",
    "Detail2_EN": "After fifty, you're almost giving up on fame and fortune. Who knew that delayed wealth would come pressing? Great prospects lie ahead. You must do more good deeds and accumulate blessings, always keep good thoughts in your heart. Your life will be even longer, your position even higher. This sign shows: late fortune comes, but virtue sustains it. Do good, and blessings multiply.",
    "Story_EN": "The Steadfast",
    "Story_Brief_EN": "An envoy remained loyal for nineteen years in captivity, holding his staff, finally returned home, and became a model of loyalty.",
    "Items_EN": "Career: Perseverance; Wealth: Limited; Relationships: Await Timing"
  },
  {
    "number": 98,
    "Level": "中吉",
    "Content": "经营百出费精神，南北奔驰运未新，玉兔交时当得意，恰如枯木再逢春。",
    "Detail1": "此签先凶后吉。凡事逢春则遂。遇卯年月日。渐见生机。不可急遽贪求。枉费心力。无益于事。何如惜养精神，以待水到渠成之妙。非所谓相时而动。动罔不藏者乎。",
    "Detail2": "耗费精神在经营事业上，总是毫无头绪，即使辛勤地南北奔波，也是无济于事，必须等到卯年月日，才得以转机，此时才能渐渐顺遂，犹如干枯的树木，每到春天的时候，依然能发出新芽，犹如重生。此签表示必须经过一番辛勤的努力及失望，直到适当的时机，才得以扬眉吐气，时机未到，做任何的努力都是无济于事，时机到了，有水到渠成之势，晚景运势亨通。",
    "Story": "韩信点兵",
    "Story_Brief": "韩信善于用兵,多多益善,成为一代名将,助刘邦建立汉朝。",
    "Items": "事业:大吉;求财:有;功名:显",
    "Level_EN": "Balanced Fortune",
    "Content_EN": "All your efforts waste energy, North and south, fortune is still new, When the jade rabbit arrives, you'll succeed, Like withered wood meeting spring again.",
    "Detail2_EN": "You've spent energy on business, but it's all confused. Even working hard, traveling north and south, it's useless. You must wait until the rabbit year, month, or day for a turnaround. Only then will things gradually go smoothly. Like a withered tree, when spring comes, it can still sprout new buds. This sign shows: wait for the rabbit year—fortune will turn, new life will come.",
    "Story_EN": "The Commander",
    "Story_Brief_EN": "A commander excelled at using troops—the more, the better. He became a legendary general and helped establish a dynasty.",
    "Items_EN": "Career: Very Favorable; Wealth: Promising; Achievement: Prominent"
  },
  {
    "number": 99,
    "Level": "上上",
    "Content": "贵人遭遇水云乡，冷淡交情滋味长，黄阁开时延故客，骅骝应得骤康庄。",
    "Detail1": "此签主交友言。由疏而密。由淡而浓之象。始时贫贱相交。迹似淡漠。一旦朋友得志。贵极人臣。大有开阁相延之庆。况以车笠旧好。自无不勤加拂拭。有不如骅骝之开道路者乎。凡事先平而后奇。先名而后实。先艰阻而后顺利。大得贵人之力。",
    "Detail2": "在他乡异地所认识的朋友，不知他未来会是皇宫贵族，当时均是两袖清风之人，所以交情完全在于人品，反而能交到知心好友，他日成为高官禄爵，必能顺手提携，成为共享富贵的朋友。此签表示在穷困潦倒时，才能感到其真心，交情不因身份的而有所不同，才是真正的好友，表示得到朋友的提挈而飞黄腾达。",
    "Story": "张良拾履",
    "Story_Brief": "张良为黄石公拾履,通过考验,获得太公兵法,后助刘邦建立汉朝。",
    "Items": "功名:成;求财:有;事业:得助",
    "Level_EN": "Supreme Harmony",
    "Content_EN": "Noble meets in water-cloud land, Cold friendship, but taste is long, When the yellow hall opens, old guest invited, Fine horse runs on smooth road.",
    "Detail2_EN": "A friend you met in a foreign land—you didn't know he'd become a noble. At that time, you were both poor, so your friendship was based entirely on character. This way you could make true friends. Later, when he becomes a high official, he'll naturally help you, and you'll become friends sharing wealth. This sign shows: true friendship based on character brings future rewards.",
    "Story_EN": "The Student",
    "Story_Brief_EN": "A young man picked up shoes for an old master, passed the test, received the art of strategy, and later helped establish a dynasty.",
    "Items_EN": "Achievement: Favorable; Wealth: Promising; Career: Get Help"
  },
  {
    "number": 100,
    "Level": "上上",
    "Content": "我本天仙雷雨师，吉凶祸福我先知，至诚祷告皆灵验，抽得终签百事宜。",
    "Detail1": "此签已成功而终。前数之终。后数之始也。聚前数之终。则有丰亨豫大之象。藏后数之始。则有引伸不穷之意。是以百事皆宜。根深实茂。永远完成。然必至诚无伪。积善感通。方得受命如响之应。唯厚所以集福之本而已矣。",
    "Detail2": "天仙是众仙之上的神明，而雷雨师是掌管雨水的多寡，也是世间凡人耕作收成的重要天神，吉凶祸福凡人不可得知，而我必定知晓，至诚至信的祈祷，只要不贪心或存有害人之心，愿望必能得到实现。抽中此签为签之终，而百签也有圆满的意思，凡事皆能顺遂，必有所成。百是圆满的终点，也是起点，天地万物自有循环。",
    "Story": "终签圆满",
    "Story_Brief": "百签圆满,前数之终,后数之始,百事皆宜,根深实茂。",
    "Items": "万事:皆宜;求财:有;婚姻:成;事业:圆满",
    "Level_EN": "Supreme Harmony",
    "Content_EN": "I am the immortal thunder-rain master, I know fortune and misfortune first, Sincere prayers all come true, Drawing the final lot, all things go well.",
    "Detail2_EN": "The immortal is the god above all immortals. The thunder-rain master controls the amount of rain, an important god for mortals' farming and harvest. Mortals can't know fortune and misfortune, but I certainly know. Sincere and faithful prayers, as long as you're not greedy or harbor harmful thoughts, all wishes will be fulfilled. Drawing this final lot means all things go well—the end of previous numbers, the beginning of new numbers. All things are favorable, roots deep, fruit abundant.",
    "Story_EN": "The Completion",
    "Story_Brief_EN": "The hundred lots are complete. The end of previous numbers, the beginning of new numbers. All things are favorable, roots deep and fruit abundant.",
    "Items_EN": "All Matters: All Favorable; Wealth: Promising; Relationships: Favorable; Career: Complete"
  }
]